{"id": "Future/Like-That", "title": "Like That", "artist": ["Metro Boomin", "Kendrick Lamar", "Future"], "release_date": "2025-01-31", "genres": ["alternative hip hop", "english", "trap", "hardcore hip hop", "hip hop", "southern hip hop", "conscious hip hop"], "wikipedia_summary": ["Nayvadius DeMun Cash (né Wilburn; born November 20, 1983), known professionally as Future, is an American rapper, singer-songwriter, and record producer. Known for his mumble-styled vocals and prolific output, Future is credited with having pioneered the use of Auto-Tuned melodies in hip-hop and trap music. Due to the sustained popularity of this musical style, he is commonly regarded as one of the most influential rappers of his generation.\nBorn and raised in Atlanta, Georgia, Future signed a recording contract with Rocko's A1 Recordings in 2011, which entered a joint venture with Epic Records shortly after. His first two studio albums, Pluto (2012) and Honest (2014), were both met with critical and commercial success, spawning the platinum-certified singles \"Turn On the Lights\", \"Honest\", \"Move That Dope\" (featuring Pharrell Williams and Pusha T), and \"I Won\" (featuring Kanye West). His subsequent albums have each debuted atop the US 200; his third and fourth, (2015) and (2016), were supported by the singles \"Where Ya At\" (featuring Drake) and \"Low Life\" (featuring the Weeknd), respectively. Future's eponymous fifth album and its follow-up, (both 2017) made him the first musical act to release two chart-topping projects on the 200 in consecutive weeks—the former spawned his first Hot 100-top ten single, \"Mask Off.\"", "Leland Tyler Wayne (born September 16, 1993), known professionally as Metro Boomin, is an American record producer and music executive. Widely acclaimed for his dark and cinematic production style, he is regarded as one of the most influential producers in modern hip-hop and trap music. He has produced notable hits for artists such as Future, Post Malone, 21 Savage, Offset, Migos, Kanye West, The Weeknd, Gunna, Gucci Mane, Young Thug, Kodak Black, Drake, and Kendrick Lamar.\nRaised in St. Louis, Missouri, Wayne began his career in music production in 2009 at the age of 16. He relocated to Atlanta to attend Morehouse College in 2011, during which he worked extensively with Atlanta-based artists including Future, Young Thug, 21 Savage, Gucci Mane, and Migos. Wayne gained wider recognition for co-producing the 2014 single \"Tuesday\" for iLoveMakonnen, which peaked at number 12 on the Hot 100. He was credited on a string of similarly successful singles throughout 2016, including \"Jumpman\" by Drake and Future, \"Father Stretch My Hands\" by Kanye West, \"Low Life\" by Future, and his first number-one production, \"Bad and Boujee\" by Migos. This was followed by the diamond-certified (14x platinum) \"Congratulations\" by Post Malone, \"Tunnel Vision\" by Kodak Black, \"Mask Off\" by Future, \"Bank Account\" by 21 Savage, and his second number-one production, \"Heartless\" by the Weeknd.", "Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "Kendrick-Lamar/Not-Like-Us", "title": "Not Like Us", "artist": ["Kendrick Lamar"], "release_date": "2024-05-04", "genres": ["hip hop", "producer tag - dj mustard", "pop / rock"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
