{"id": "Future/Like-That", "title": "Like That", "artist": ["Metro Boomin", "Kendrick Lamar", "Future"], "release_date": "2025-01-31", "genres": ["alternative hip hop", "english", "trap", "hardcore hip hop", "hip hop", "southern hip hop", "conscious hip hop"], "wikipedia_summary": ["Nayvadius DeMun Cash (né Wilburn; born November 20, 1983), known professionally as Future, is an American rapper, singer-songwriter, and record producer. Known for his mumble-styled vocals and prolific output, Future is credited with having pioneered the use of Auto-Tuned melodies in hip-hop and trap music. Due to the sustained popularity of this musical style, he is commonly regarded as one of the most influential rappers of his generation.\nBorn and raised in Atlanta, Georgia, Future signed a recording contract with Rocko's A1 Recordings in 2011, which entered a joint venture with Epic Records shortly after. His first two studio albums, Pluto (2012) and Honest (2014), were both met with critical and commercial success, spawning the platinum-certified singles \"Turn On the Lights\", \"Honest\", \"Move That Dope\" (featuring Pharrell Williams and Pusha T), and \"I Won\" (featuring Kanye West). His subsequent albums have each debuted atop the US 200; his third and fourth, (2015) and (2016), were supported by the singles \"Where Ya At\" (featuring Drake) and \"Low Life\" (featuring the Weeknd), respectively. Future's eponymous fifth album and its follow-up, (both 2017) made him the first musical act to release two chart-topping projects on the 200 in consecutive weeks—the former spawned his first Hot 100-top ten single, \"Mask Off.\"", "Leland Tyler Wayne (born September 16, 1993), known professionally as Metro Boomin, is an American record producer and music executive. Widely acclaimed for his dark and cinematic production style, he is regarded as one of the most influential producers in modern hip-hop and trap music. He has produced notable hits for artists such as Future, Post Malone, 21 Savage, Offset, Migos, Kanye West, The Weeknd, Gunna, Gucci Mane, Young Thug, Kodak Black, Drake, and Kendrick Lamar.\nRaised in St. Louis, Missouri, Wayne began his career in music production in 2009 at the age of 16. He relocated to Atlanta to attend Morehouse College in 2011, during which he worked extensively with Atlanta-based artists including Future, Young Thug, 21 Savage, Gucci Mane, and Migos. Wayne gained wider recognition for co-producing the 2014 single \"Tuesday\" for iLoveMakonnen, which peaked at number 12 on the Hot 100. He was credited on a string of similarly successful singles throughout 2016, including \"Jumpman\" by Drake and Future, \"Father Stretch My Hands\" by Kanye West, \"Low Life\" by Future, and his first number-one production, \"Bad and Boujee\" by Migos. This was followed by the diamond-certified (14x platinum) \"Congratulations\" by Post Malone, \"Tunnel Vision\" by Kodak Black, \"Mask Off\" by Future, \"Bank Account\" by 21 Savage, and his second number-one production, \"Heartless\" by the Weeknd.", "Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "Kendrick-Lamar/Not-Like-Us", "title": "Not Like Us", "artist": ["Kendrick Lamar"], "release_date": "2025-02-06", "genres": ["alternative hip hop", "conscious hip hop", "hip hop", "hardcore hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "Kendrick-Lamar/Tv-Off", "title": "tv off", "artist": ["Kendrick Lamar", "Lefty GunPlay"], "release_date": "2025-02-06", "genres": ["alternative hip hop", "conscious hip hop", "hip hop", "hardcore hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart.", "Franklin Scott Holladay, better known by his stage name Lefty Gunplay, is an American rapper from Los Angeles. Born and raised in Baldwin Park, Holladay is signed to JasonMartin's label Diamond Lane Music Group, as well as OTR Records as of 2024 and has released four albums, including Rookie of the Year and Most Valuable Gangbanger. He gained recognition for his feature on Kendrick Lamar's GNX single \"TV Off\"."]}
{"id": "Kendrick-Lamar/Reincarnated", "title": "reincarnated", "artist": ["Kendrick Lamar"], "release_date": "2024-11-22", "genres": ["funk", "hardcore hip hop", "hip hop", "contemporary r&b", "soul", "west coast hip hop", "conscious hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "Kendrick-Lamar/Squabble-Up", "title": "squabble up", "artist": ["Kendrick Lamar"], "release_date": "2024-11-25", "genres": ["alternative hip hop", "conscious hip hop", "hip hop", "hardcore hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "21-Savage/Redrum", "title": "redrum", "artist": ["21 Savage"], "release_date": "2024-01-12", "genres": ["gangsta rap", "mumble rap", "hip hop", "pop rap"], "wikipedia_summary": ["Shéyaa Bin Abraham-Joseph (born October 22, 1992), known professionally as 21 Savage, is an American and British rapper. Born in London and raised in Atlanta, he began his recording career in 2013 and released three independent mixtapes to regional acclaim. His breakout project—the collaborative extended play (EP) with record producer Metro Boomin titled Savage Mode (2016)—peaked at number 23 on the Billboard 200. Its lead singles, \"X\" (featuring Future) and \"No Heart\" both peaked within the top 40 of the Billboard Hot 100. Later that year, he saw further recognition for his guest appearance on Drake's single \"Sneakin'\". He then signed a recording contract with Epic Records in January 2017.\n21 Savage's debut studio album, Issa Album (2017), peaked at number two on the Billboard 200, while its lead single, \"Bank Account\" peaked at number 12 on the Hot 100. That same year, he released the collaborative album (2017) with Metro Boomin and fellow Georgia-based rapper Offset, and guest appeared on Post Malone's 2017 single \"Rockstar\", which peaked atop the Hot 100 and received two nominations—Record of the Year and Best Rap/Sung Performance—at the 61st Annual Grammy Awards. His second album, (2018), became his first to debut atop the 200 and spawned the single \"A Lot\" (featuring J. Cole), which won Best Rap Song at the 62nd Annual Grammy Awards. The following year, he and Metro Boomin released a sequel to their breakout EP with (2020), which also debuted atop the 200 and spawned the top ten-singles \"Runnin\" and \"Mr. Right Now\" (featuring Drake). He guest appeared on Drake's 2022 single \"Jimmy Cooks\", which marked his first song to debut atop the Hot 100 and second to do so overall. Later that year, he and Drake released the collaborative album (2022), which saw continued success as his third project to peak the 200. His third album, (2024), became his fourth consecutive chart-topping project, and spawned the Hot 100 top-ten songs \"Redrum\" and \"Née-Nah\"."]}
{"id": "Tyler,-the-Creator/Balloon", "title": "Balloon", "artist": ["Tyler, The Creator", "Doechii"], "release_date": "2025-01-15", "genres": ["hip hop", "horrorcore", "_fix whosampled dupe url", "hardcore hip hop"], "wikipedia_summary": ["Tyler Gregory Okonma (born March 6, 1991), known professionally as Tyler, the Creator, is an American rapper, singer, songwriter, and record producer. He has been cited as an influential figure in alternative hip-hop during the 2010s. Okonma became well known in the late 2000s, when he emerged on the internet as the leader and co-founder of the music collective Odd Future. Within the group, Okonma participated as a rapper, producer, director and actor, releasing studio albums that he produced for its respective members. Okonma also performed on the group's sketch comedy show Loiter Squad (2012–2014).\nAlong with his collaborations with the group, Okonma developed his solo career beginning with his self-released debut studio album, Bastard (2009). earned him recognition in the online music press as an emerging artist from the indie music scene. His second studio album, (2011), brought him mainstream media exposure, aided by the popularity of the single \"Yonkers\" and its accompanying music video. During this period, Okonma faced controversy in the media for his horrorcore-influenced sound and his violent, transgressive lyrical content.", "Jaylah Ji'mya Hickmon (born August 14, 1998), known professionally as Doechii (), is an American rapper, singer, and songwriter. She first gained attention on TikTok, leading her to sign with Top Dawg Entertainment and Capitol Records in 2022. Her 2023 single \"What It Is (Block Boy)\", which features Kodak Black, became her first entry on the Billboard Hot 100 and received a platinum certification by the Recording Industry Association of America (RIAA).\nDoechii's third mixtape, Alligator Bites Never Heal (2024), peaked at number 14 on the Billboard 200 and was met with critical acclaim. It won Best Rap Album at the 67th Annual Grammy Awards, making her the third female artist to win in the category. It spawned the singles \"Nissan Altima\" and \"Denial Is a River\". Her 2025 single \"Anxiety\" became her highest charting entry on the Hot 100."]}
{"id": "Kendrick-Lamar/Meet-the-Grahams", "title": "meet the grahams", "artist": ["Kendrick Lamar"], "release_date": "2024-05-04", "genres": ["alternative hip hop", "conscious hip hop", "hip hop", "hardcore hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "JPEGMAFIA/Either-on-or-Off-the-Drugs", "title": "either on or off the drugs", "artist": ["JPEGMAFIA"], "release_date": "2024-08-01", "genres": ["drumless hip hop"], "wikipedia_summary": ["Barrington DeVaughn Hendricks (born October 22, 1989), known professionally as JPEGMafia (stylized in all caps as JPEGMAFIA), is an American rapper, singer, and record producer. Born in Flatbush, Brooklyn, he signed with Deathbomb Arc to release his debut studio album, Black Ben Carson (2016) and his second album Veteran (2018), which received widespread critical acclaim. His third album, All My Heroes Are Cornballs (2019) was released through EQT Recordings and entered the Billboard 200, and had signed to Republic for the release of his fourth album LP! (2021); both were met with continued critical acclaim. In 2023, he released his collaborative studio album Scaring the Hoes with fellow alternative rapper Danny Brown through AWAL. In 2024, he released his fifth studio album I Lay Down My Life for You."]}
{"id": "%C2%A5$/CARNIVAL", "title": "CARNIVAL", "artist": ["¥$", "Rich the Kid", "Playboi Carti"], "release_date": "2024-02-15", "genres": ["english", "plugg", "hip house", "trap", "hip hop", "cloud rap", "r&b", "southern hip hop", "alternative r&b", "conscious hip hop", "electropop", "chipmunk soul", "christian hip hop"], "wikipedia_summary": ["¥$ is an American hip hop superduo composed of rapper Kanye West and singer Ty Dolla Sign. With the two maintaining a strong relationship during 2023, West invited Ty Dolla Sign to record songs in Tokyo, Italy, and later Saudi Arabia. During the recording sessions for West's eleventh studio album, the duo began work on their collaborative effort, Vultures 1 (2024), which received mixed reviews from critics and was a commercial success that topped the US Billboard 200.\nVultures 1 spawned the single \"Carnival\" (with Rich the Kid featuring Playboi Carti), which peaked atop the US Billboard Hot 100. After several delays, the duo's second album, Vultures 2 (2024), was released in August of that year. It was met with weaker sales—peaking at number two on the 200—and negative reception from critics, who felt the album was exceedingly unfinished. They won Best Group at the BET Awards 2024.", "Ye ( YAY), born Kanye Omari West ( KAHN-yay; June 8, 1977), is an American rapper and record producer. One of the most prominent figures in hip-hop, he is known for his varying musical style and polarizing cultural and political commentary. After dropping out of college to pursue a career in music, West began producing for regional artists in the Chicago area. As an in-house producer for Roc-A-Fella Records, he co-produced albums including Jay-Z's The Blueprint (2001) before signing with the label as a recording artist. West's debut studio album, The College Dropout (2004), was met with critical acclaim and yielded the Billboard Hot 100-number one single \"Slow Jamz\". He peaked the chart on four other occasions with the singles \"Gold Digger\" (2005), \"Stronger\" (2007), \"E.T.\" (2011, as a featured artist), and \"Carnival\" (2024).", "Tyrone William Griffin Jr. (born April 13, 1982), known professionally as Ty Dolla Sign (stylized as Ty Dolla $ign or Ty$), is an American singer, songwriter, and record producer. Born and raised in Los Angeles, California, Griffin gained initial recognition for his guest appearance on fellow Los Angeles rapper YG's 2010 single \"Toot It and Boot It\", which entered the Billboard Hot 100. He signed with Atlantic Records in 2012, and Wiz Khalifa's Taylor Gang Entertainment the following year.\nGriffin saw further mainstream recognition for his debut commercial extended play (EP), Beach House EP (2014). Its release was preceded by his 2013 single \"Paranoid\" (featuring B.o.B), which marked his first entry—at number 29—on the Billboard Hot 100 as a lead artist. Its 2014 follow-up, \"Or Nah\" (featuring Wiz Khalifa and DJ Mustard, remixed with the Weeknd) was met with continued success and received sextuple platinum certification from the Recording Industry Association of America (RIAA). His debut studio album, (2015), peaked at number 14 on the 200 and was supported by the platinum-certified singles \"Blasé\" (featuring Future and Rae Sremmurd) and \"Saved\" (featuring E-40). His second album, (2017) peaked at number 11 on the 200, while his third album, (2020) peaked at number four. He has released the collaborative albums (2018) with Jeremih, (2021) with Dvsn, and and (2024) with Kanye West— became his first to debut atop the 200.", "Jordan Terrell Carter (born September 13, 1995 or 1996), known professionally as Playboi Carti, is an American rapper. He first signed with local underground record label Awful Records in 2014, and later signed with ASAP Mob's record label AWGE, in a joint venture with Interscope Records two years later. Carter gained mainstream attention following the release of his eponymous debut mixtape (2017), which peaked at number 12 on the U.S. Billboard 200 and spawned the Billboard Hot 100-charting singles \"Magnolia\" and \"Wokeuplikethis\" (featuring Lil Uzi Vert).\nCarter's debut studio album Die Lit (2018) saw further commercial success, peaking at number three on the Billboard 200. Following a two-year hiatus, his second studio album, Whole Lotta Red (2020) debuted atop the chart and was met with positive reviews; it was listed as among the best albums of that year by and , with ranking it on their list of the \"200 Greatest Hip-Hop Albums of All Time\". He guest performed on ¥$'s 2024 single, \"Carnival\", which became his first song to peak atop the Hot 100. Carter's third studio album, (2025), was given similarly positive reviews and became his second consecutive number-one album on the 200.", "Dimitri Leslie Roger (born July 13, 1992), known professionally as Rich the Kid, is an American rapper. After a number of independent mixtapes, he signed with Interscope Records in 2017 to release his debut studio album, The World Is Yours (2018). Supported by the singles \"New Freezer\" (featuring Kendrick Lamar) and \"Plug Walk\", the album peaked at number two on the Billboard 200. His second and third studio albums, The World Is Yours 2 (2019) and Boss Man (2020) peaked at numbers four and 24 on the chart, respectively. He has also released the collaborative mixtapes Nobody Safe (2020) with YoungBoy Never Broke Again, and Trust Fund Babies (2021) with Lil Wayne. Furthermore, he founded the record label Rich Forever Music in 2016, through which he has signed rappers Famous Dex and Jay Critch."]}
{"id": "Eazy-E/Eazy-Duz-It", "title": "Eazy-Duz-It", "artist": ["Eazy‐E"], "release_date": "1988", "genres": ["gangsta rap", "hip hop", "west coast hip hop", "g-funk"], "wikipedia_summary": ["Eric Lynn Wright (September 7, 1964 – March 26, 1995), known professionally by his stage name Eazy-E, was an American rapper who propelled West Coast rap and gangsta rap by leading the group N.W.A and its label, Ruthless Records. He is often referred to as the \"Godfather of Gangsta Rap\".\nBorn and raised in Compton, California, Wright had several legal troubles before founding Ruthless in 1987. After a short solo career with frequent collaboration with Ice Cube and Dr. Dre, they joined, forming N.W.A, later that year. N.W.A's debut studio album, Straight Outta Compton, was released in 1989. Controversial upon release, it is now ranked among the greatest and most influential albums ever. The group released its second and final studio album, , in 1991, and soon after disbanded."]}
{"id": "Rodney-O-and-Joe-Cooley/Everlasting-Bass", "title": "Everlasting Bass", "artist": ["Rodney O & Joe Cooley"], "release_date": "1988", "genres": ["west coast rap", "rap"], "wikipedia_summary": ["Rodney-O & Joe Cooley, consisting of rapper Rodney Oliver, also known as \"Rodney O\", DJ Joe Cooley (August 15 1965) and Jeffrey Page, also known as \"General Jeff\", is an American rap group from Southern California. Rodney O, from Riverside, and Joe Cooley, from Compton, and General Jeff, from Los Angeles. Best known for tracks such as \"Everlasting Bass,\" \"Cooley High,\" and \"This is for the Homies.\" At the height of their popularity, the group toured with MC Lyte, N.W.A, Kool Moe Dee and Grandmaster Flash. The group would gain more popularity in South Florida than their native Southern California, giving them a pioneering role in Miami bass.\nIn 2015, Rolling Stone named “Everlasting Bass” as one of the 20 greatest West Coast Rap Songs released prior to N.W.A's 1989 album Straight Outta Compton. After over a decade of silence, the group announced that they were planning a new album in 2011. The album was tentatively titled , but only the single \"That Supa Radio\" materialized."]}
{"id": "Birdman/Pop-Bottles", "title": "Pop Bottles", "artist": ["Lil Wayne", "Birdman"], "release_date": "2011-03", "genres": ["2000s", "hip hop", "criminal", "2010s", "rap", "gangsta rap"], "wikipedia_summary": ["Bryan Christopher Williams (né Brooks; February 15, 1969), better known by his stage names Birdman or Baby, is an American rapper and record executive. He is the public face of Cash Money Records, a record label he co-founded with his older brother, Ronald \"Slim\" Williams, in 1991. Birdman released his eponymous debut studio album in 2002, and released three follow-up albums—Fast Money (2005), 5 * Stunna (2007), and Priceless (2009)—to moderate commercial success and mixed critical reception. Along with his solo career, he is a member of the hip hop duo Big Tymers with producer Mannie Fresh, as well as the supergroup Cash Money Millionaires.\nApart from his solo work and five releases as part of Big Tymers, Birdman is best known for his discovery and mentorship of fellow New Orleans rapper Lil Wayne, with whom he released the collaborative album, (2006). As label-head of Cash Money Records, he has been central to the career and commercial success of Wayne, as well as future signees including Drake, Nicki Minaj, and Tyga. Many acts were signed in a joint venture with Wayne's Young Money Entertainment (branded as \"YMCMB\"), a label that ran as an imprint of Cash Money from its formation in 2005 until 2018. Birdman also founded the spin-off project Rich Gang in 2014, a loose-knit collective assembled from core signees of both labels; it was joined and soon led by then-upcoming Southern rappers Young Thug and Rich Homie Quan, as well as other artists not directly signed to the labels.", "Dwayne Michael Carter Jr. (born September 27, 1982), known professionally as Lil Wayne, is an American rapper. He is often regarded as one of the most influential hip hop artists of his generation, as well as one of the greatest rappers of all time. Born and raised in New Orleans, he was discovered by hometown rapper Birdman in 1993 and signed with his record label, Cash Money Records, at age eleven. He emerged as the label's flagship artist until his departure in June 2018.\nHe was first placed in a duo with Cash Money labelmate B.G. (then known as Lil Doogie) in 1994—known collectively as the B.G.'z—and they released an album, True Story, in July of that year, although Carter (at the time known as Baby D) appeared on only three its tracks. Carter and B.G. then formed the Southern hip-hop group Hot Boys with labelmates Juvenile and Turk in 1997; they released their debut album, in October of that year. The Hot Boys gained mainstream success following the release of their second album (1999), and their appearance on B.G.'s single, \"Bling Bling\". The group briefly disbanded after the album due to each member (besides Carter) parting ways with the label, although one further album— (2003)—was released."]}
{"id": "Monk-Higgins/I-Believe-to-My-Soul", "title": "I Believe To My Soul", "artist": ["Monk Higgins"], "release_date": "1968", "genres": ["jazz", "2008 universal fire victim"], "wikipedia_summary": ["Milton Bland (October 3, 1936 – July 3, 1986), better known as Monk Higgins, was an American composer, producer, arranger, tenor saxophonist, keyboardist, and music executive born in Menifee, Arkansas."]}
{"id": "The-Sixth-Sense/I-See-Dead-People", "title": "I See Dead People", "artist": "The Sixth Sense", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "YG/I%27m-Good", "title": "I’m Good", "artist": ["YG"], "release_date": "2011-05-02", "genres": ["hip hop", "ratchet music", "west coast hip hop", "drake"], "wikipedia_summary": ["Keenon Dequan Ray Jackson (born March 9, 1990), better known by his stage name YG (short for Young Gangsta), is an American rapper. He released his debut mixtape 4Fingaz in 2008, and its follow-up, The Real 4Fingaz, the following year. The latter gained recognition for its local hit song \"Toot It and Boot It\", which entered the Billboard Hot 100 at number 67 and received platinum certification by the Recording Industry Association of America (RIAA). He signed a recording contract with Def Jam Recordings in October 2009, which entered joint-venture with Atlanta-based rapper Jeezy's record label, CTE World, in 2013.\nHis 2013 single, \"My Nigga\" (featuring Jeezy and Rich Homie Quan), peaked at number 19 on the Billboard Hot 100. The song and its follow-ups, \"Left, Right\" (featuring DJ Mustard) and \"Who Do You Love?\" (featuring Drake), preceded the release of his debut studio album, (2014), which peaked at number two on the 200 and saw positive critical reception. Also in 2014, he guest appeared on Jeremih's single \"Don't Tell 'Em\", which peaked at number six on the Hot 100 and remains his highest-charting song. His second album, (2016), was met with critical acclaim despite less commercial orientation, as it explored political and social issues for its subject matter."]}
{"id": "2Pac/Made-Niggas", "title": "Made Niggas", "artist": ["2Pac", "Outlawz"], "release_date": "1996", "genres": ["death by murder", "g-funk", "hip hop", "90s", "gangsta rap", "conscious hip hop"], "wikipedia_summary": ["Tupac Amaru Shakur ( ; born Lesane Parish Crooks; June 16, 1971 – September 13, 1996), also known by his stage names 2Pac and Makaveli, was an American rapper and actor. He is regarded as one of the greatest and most influential rappers of all time. Academics regard him as one of the most influential music artists of the 20th century and a prominent political activist for Black America. In addition to his music career, Shakur also wrote poetry and starred in films. He is among the best-selling music artists, having sold more than 75 million records worldwide. His lyrical content has been noted for addressing social injustice, political issues, and the marginalization of other African-Americans, but he was also synonymous with gangsta rap and violent lyrics.", "Outlawz was an American hip-hop group founded by Tupac Shakur and Yafeu Fula in 1995. Originally known as Thoro Headz and Young Thugs, the group attracted attention with their appearance on Tupac's song \"Flex\", which was the B-side of his single \"Holler If Ya Hear Me\", released on February 4, 1993.\nThe group formed as Dramacydal and appeared on the tracks \"Me Against the World\" and \"Outlaw\" from Shakur's album Me Against the World, released on March 14, 1995."]}
{"id": "Debbie-Deb/When-I-Hear-Music", "title": "When I Hear Music", "artist": ["Debbie Deb"], "release_date": "2008-02-11", "genres": ["breaks", "dance", "hip hop", "rap and hip-hop", "electro", "freestyle", "electronic"], "wikipedia_summary": ["Deborah Claire Wesoff-Kowalski (born March 10, 1966), known professionally as Debbie Deb, is an American singer and songwriter best known for her 1980s freestyle dance singles \"Lookout Weekend\" and \"When I Hear Music\"."]}
{"id": "21-Savage/A-Lot", "title": "a lot", "artist": ["21 Savage"], "release_date": "N/A", "genres": ["gangsta rap", "mumble rap", "hip hop", "pop rap"], "wikipedia_summary": ["Shéyaa Bin Abraham-Joseph (born October 22, 1992), known professionally as 21 Savage, is an American and British rapper. Born in London and raised in Atlanta, he began his recording career in 2013 and released three independent mixtapes to regional acclaim. His breakout project—the collaborative extended play (EP) with record producer Metro Boomin titled Savage Mode (2016)—peaked at number 23 on the Billboard 200. Its lead singles, \"X\" (featuring Future) and \"No Heart\" both peaked within the top 40 of the Billboard Hot 100. Later that year, he saw further recognition for his guest appearance on Drake's single \"Sneakin'\". He then signed a recording contract with Epic Records in January 2017.\n21 Savage's debut studio album, Issa Album (2017), peaked at number two on the Billboard 200, while its lead single, \"Bank Account\" peaked at number 12 on the Hot 100. That same year, he released the collaborative album (2017) with Metro Boomin and fellow Georgia-based rapper Offset, and guest appeared on Post Malone's 2017 single \"Rockstar\", which peaked atop the Hot 100 and received two nominations—Record of the Year and Best Rap/Sung Performance—at the 61st Annual Grammy Awards. His second album, (2018), became his first to debut atop the 200 and spawned the single \"A Lot\" (featuring J. Cole), which won Best Rap Song at the 62nd Annual Grammy Awards. The following year, he and Metro Boomin released a sequel to their breakout EP with (2020), which also debuted atop the 200 and spawned the top ten-singles \"Runnin\" and \"Mr. Right Now\" (featuring Drake). He guest appeared on Drake's 2022 single \"Jimmy Cooks\", which marked his first song to debut atop the Hot 100 and second to do so overall. Later that year, he and Drake released the collaborative album (2022), which saw continued success as his third project to peak the 200. His third album, (2024), became his fourth consecutive chart-topping project, and spawned the Hot 100 top-ten songs \"Redrum\" and \"Née-Nah\".", "Jermaine Lamarr Cole (born January 28, 1985) is an American rapper and record producer. Born in a military base in Germany and raised in Fayetteville, North Carolina, Cole initially gained attention as a rapper following the release of his debut mixtape, The Come Up, in early 2007. Intent on further pursuing a musical career, he signed with Jay-Z's Roc Nation in 2009 and released two additional mixtapes: The Warm Up (2009) and Friday Night Lights (2010) to further critical acclaim as he garnered a wider following.\nEach of Cole's studio albums have peaked atop the US Billboard 200, beginning with his debut, Cole World: The Sideline Story (2011), and its follow-up, Born Sinner (2013). Both met with critical acclaim, the albums spawned the Billboard Hot 100-top 40 singles \"Work Out\", \"Power Trip\" (featuring Miguel), and \"Crooked Smile\" (featuring TLC). Despite commercial success, Cole departed from the pop-oriented sound of the albums in favor of conscious subject matter for his subsequent projects; themes of nostalgia, racial inequality, and materialism were explored respectively in his following releases: (2014), (2016) and (2018). yielded his furthest commercial success—selling an estimated 500,000 album-equivalent units in its first week, while the latter featured a then-record six simultaneous top 20 hits on the Hot 100—the first time a musical act achieved this feat since English rock band the Beatles in 1964. His sixth album, (2021), was met with continued success and spawned the single \"My Life\" (with 21 Savage and Morray), which peaked at number two on the Hot 100. Its chart success was matched by his guest appearance on the 2023 single \"All My Life\" by Lil Durk, and succeeded by his first song to peak the chart, \"First Person Shooter\" by Drake that same year. The former also won Cole a Grammy Award for Best Melodic Rap Performance."]}
{"id": "Akiko-Yano/%E3%83%A8%E3%83%BB%E3%83%AD%E3%83%BB%E3%82%B3%E3%83%BB%E3%83%93", "title": "ヨ・ロ・コ・ビ", "artist": "Akiko Yano", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Akiko Yano (矢野 顕子, Yano Akiko, born Akiko Suzuki (鈴木 顕子, Suzuki Akiko); February 13, 1955) is a Japanese pop and jazz musician and singer born in Tokyo and raised in Aomori and later began her singing career in the mid-1970s. She has been called \"one of the major musical talents of the Japanese popular music world\", and her vocals and singing style have been compared to English singer Kate Bush (who she predates by several years).\nShe has recorded with Yellow Magic Orchestra and its members Ryuichi Sakamoto, Haruomi Hosono and Yukihiro Takahashi, as well as with Swing Out Sister, Pat Metheny, The Chieftains, Lyle Mays, members of Little Feat, David Sylvian, Mick Karn, Kenji Omura, Gil Goldstein, Toninho Horta, Mino Cinelu, Jeff Bova, Charlie Haden, Peter Erskine, Anthony Jackson, David Rhodes, Bill Frisell, Thomas Dolby, the band Quruli, Rei Harakami as Yanokami and her daughter Miu Sakamoto."]}
{"id": "Monk-Higgins/Mac-Arthur-Park", "title": "Mac Arthur Park", "artist": ["Monk Higgins"], "release_date": "1968", "genres": ["jazz", "2008 universal fire victim"], "wikipedia_summary": ["Milton Bland (October 3, 1936 – July 3, 1986), better known as Monk Higgins, was an American composer, producer, arranger, tenor saxophonist, keyboardist, and music executive born in Menifee, Arkansas."]}
{"id": "Elza-Laranjeira/Serenata-Do-Adeus", "title": "Serenata Do Adeus", "artist": "Elza Laranjeira", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "The-Shining/Here%27s-Johnny!", "title": "Here's Johnny!", "artist": "The Shining", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "Luke/I-Wanna-Rock", "title": "I Wanna Rock", "artist": ["Luke"], "release_date": "1998-03-24", "genres": ["hip hop", "hip-hop", "dirty rap", "american"], "wikipedia_summary": ["Luther Roderick Campbell (born December 22, 1960), also known as Luke Skyywalker, Uncle Luke and simply Luke, is an American rapper, promoter, record executive, actor, and former leader of the rap group 2 Live Crew. He is known for having helped create the Miami bass genre, for establishing one of the first rap groups and rap labels in Southern hip hop, and his sexually crude call and response lyrics which were unique for the time period. He also starred in a short-lived show on VH1, Luke's Parental Advisory."]}
{"id": "John-Barry/The-Black-Hole-Overture", "title": "The Black Hole - Overture", "artist": "John Barry", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["John Barry Prendergast (3 November 1933 – 30 January 2011) was an English composer and conductor of film music. Born in York, Barry spent his early years working in cinemas owned by his father. During his national service with the British Army in Cyprus, Barry began performing as a musician after learning to play the trumpet. Upon completing his national service, he formed a band in 1957, the John Barry Seven. He later developed an interest in composing and arranging music, making his début for television in 1958. He came to the notice of the filmmakers of the first James Bond film Dr. No, who were dissatisfied with a theme for James Bond given to them by Monty Norman. Noel Rogers, the head of music at United Artists, approached Barry. This started a successful association between Barry and the Bond series that lasted for 25 years."]}
{"id": "Andrew-Wartts/Can-You-Say-Yeah%3F", "title": "Can You Say Yeah", "artist": ["Andrew Wartts and The Gospel Storytellers"], "release_date": "1982", "genres": [], "wikipedia_summary": ["N/A", "N/A"]}
{"id": "Timothy-Carpenter/I-Want-to-Make-It", "title": "I Want to Make It", "artist": "Timothy Carpenter, Triunity", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["John Howard Carpenter (born January 16, 1948) is an American filmmaker, composer, and actor. Most commonly associated with horror, action, and science fiction films of the 1970s and 1980s, he is generally recognized as a master of the horror genre. At the 2019 Cannes Film Festival, the French Directors' Guild gave him the Golden Coach Award and lauded him as \"a creative genius of raw, fantastic, and spectacular emotions\". On April 3, 2025, he received a star on the Hollywood Walk of Fame.\nCarpenter's early films included critical and commercial successes such as Halloween (1978), The Fog (1980), Escape from New York (1981), and Starman (1984). Though he has been acknowledged as an influential filmmaker, his other productions from the 1970s and the 1980s only later came to be considered cult classics; these include (1974), (1976), (1982), (1983), (1986), (1987), (1988), (1994), and (1996). He returned to the franchise as a composer and executive producer on (2018), (2021), and (2022).", "N/A"]}
{"id": "AI-for-the-Culture/Turn-on-the-Lights", "title": "Turn on the Lights", "artist": "AI for the Culture", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Ai Carina Uemura (植村 愛 カリーナ, Uemura Ai Karīna, born November 2, 1981), known mononymously as Ai (Japanese pronunciation: [ai], stylized as AI or A.I. ), is a Japanese-American singer, songwriter and rapper. Born in Los Angeles, Ai moved to Kagoshima at age four. Motivated to become a singer, she returned to Los Angeles during her adolescence, attending the Los Angeles County High School for the Arts. While in Los Angeles, she performed as part of a gospel choir at a Mary J. Blige concert and appeared as a backup dancer in Janet Jackson's music video, \"Go Deep\". She briefly joined the Asian girl group SX4 in 1999 until she graduated high school."]}
{"id": "The-Notorious-B.I.G./Kick-in-the-Door", "title": "Kick In the Door", "artist": ["The Notorious B.I.G."], "release_date": "1997-03-04", "genres": ["rap/hip hop", "hip hop", "thug rap", "east coast rap", "east coast hip hop", "pop-rap", "rap", "hip hop/rap", "gangsta rap", "hip-hop/rap"], "wikipedia_summary": ["Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names the Notorious B.I.G., Biggie Smalls, and Biggie, was an American rapper. Rooted in the New York rap scene and gangsta rap traditions, he is widely considered one of the greatest rappers of all time. Wallace became known for his distinctive, laidback lyrical delivery, offsetting his lyrics' often grim content. His music was usually semi-autobiographical, telling of hardship and criminality but also of debauchery and celebration.\nBorn and raised in Brooklyn, New York City, Wallace was the first artist to sign with Sean \"Puffy\" Combs's Bad Boy Records in 1993. That same year, he gained recognition for his guest appearances on other artists' singles. His debut studio album, Ready to Die (1994), received widespread critical acclaim and included signature tracks \"Juicy\" and \"Big Poppa\". This album made him the central figure in East Coast hip hop, helping to restore New York's prominence at a time when the West Coast was dominating the genre. In 1995, Wallace was named Rapper of the Year at the Music Awards. That same year, Wallace and his protégé group, Junior M.A.F.I.A.—which included longtime friends like Lil' Kim—released their debut album, (1995)."]}
{"id": "ExpertVillage-Leaf-Group/Importing-the-JPEG-for-Digital-Embroidery-Machine-Designs", "title": "Importing the JPEG for Digital Embroidery Machine Designs", "artist": "ExpertVillage Leaf Group", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Carbon Leaf is a quintet from Richmond, Virginia, known for their alt-country, Celtic, and folk-infused indie rock. Though some of the band members have changed through the years, Carbon Leaf has been consistently creating and performing music since the early 1990s. The band currently consists of founding members Barry Privett, Carter Gravatt, and Terry Clark, as well as Jon Markel and Jesse Humphrey. Carbon Leaf is best known for the song \"Life Less Ordinary\", which debuted in 2004 and reached #5 on Billboard's Adult Alternative charts."]}
{"id": "Kanye-West/Hell-of-a-Life", "title": "Hell of a Life", "artist": ["Kanye West"], "release_date": "2010-11-22", "genres": ["rap"], "wikipedia_summary": ["Ye ( YAY), born Kanye Omari West ( KAHN-yay; June 8, 1977), is an American rapper and record producer. One of the most prominent figures in hip-hop, he is known for his varying musical style and polarizing cultural and political commentary. After dropping out of college to pursue a career in music, West began producing for regional artists in the Chicago area. As an in-house producer for Roc-A-Fella Records, he co-produced albums including Jay-Z's The Blueprint (2001) before signing with the label as a recording artist. West's debut studio album, The College Dropout (2004), was met with critical acclaim and yielded the Billboard Hot 100-number one single \"Slow Jamz\". He peaked the chart on four other occasions with the singles \"Gold Digger\" (2005), \"Stronger\" (2007), \"E.T.\" (2011, as a featured artist), and \"Carnival\" (2024)."]}
{"id": "Jadakiss/Put-Ya-Hands-Up", "title": "Put Ya Hands Up", "artist": ["Jadakiss"], "release_date": "N/A", "genres": ["hip hop", "east coast hip hop"], "wikipedia_summary": ["Jason Terrance Phillips (born May 27, 1975), better known by his stage name Jadakiss (, JAY-duh-kiss), is an American rapper who began his career in the 1990s and formed the hip hop trio the Lox alongside Styles P and Sheek Louch in 1994. The group signed with Puff Daddy's Bad Boy Records, an imprint of Arista Records to release their debut studio album, Money, Power & Respect (1998); their second album, We Are the Streets (2000) was released by Ruff Ryders Entertainment, an imprint of Interscope Records. Both peaked within the top five of the Billboard 200 and yielded critical praise; their two subsequent albums, Filthy America... It's Beautiful (2016) and Living Off Xperience (2020) were both released by Jay-Z's Roc Nation and met with continued praise."]}
{"id": "Playboi-Carti/BACKR00MS", "title": "BACKR00MS", "artist": ["Playboi Carti", "Travis Scott"], "release_date": "2024", "genres": ["english", "plugg", "cloud rap", "hip hop", "experimental hip hop", "pop rap"], "wikipedia_summary": ["Jordan Terrell Carter (born September 13, 1995 or 1996), known professionally as Playboi Carti, is an American rapper. He first signed with local underground record label Awful Records in 2014, and later signed with ASAP Mob's record label AWGE, in a joint venture with Interscope Records two years later. Carter gained mainstream attention following the release of his eponymous debut mixtape (2017), which peaked at number 12 on the U.S. Billboard 200 and spawned the Billboard Hot 100-charting singles \"Magnolia\" and \"Wokeuplikethis\" (featuring Lil Uzi Vert).\nCarter's debut studio album Die Lit (2018) saw further commercial success, peaking at number three on the Billboard 200. Following a two-year hiatus, his second studio album, Whole Lotta Red (2020) debuted atop the chart and was met with positive reviews; it was listed as among the best albums of that year by and , with ranking it on their list of the \"200 Greatest Hip-Hop Albums of All Time\". He guest performed on ¥$'s 2024 single, \"Carnival\", which became his first song to peak atop the Hot 100. Carter's third studio album, (2025), was given similarly positive reviews and became his second consecutive number-one album on the 200.", "Jacques Bermon Webster II (born April 30, 1991), known professionally as Travis Scott (formerly stylized as Travi$ Scott), is an American rapper, singer, songwriter, and record producer. Scott has had five number-one hits on the U.S. Billboard Hot 100 chart, along with a total of over one hundred charting songs. In addition to ten Grammy Award nominations, he has won a Latin Grammy Award, Billboard Music Award, MTV Video Music Award, and several BET Hip Hop Awards. Scott's musical style has been described as a \"blend between traditional hip-hop and lo-fi\" and often characterized as \"ambient,\" with a heavily appraised influence from rappers Kanye West and Kid Cudi. His stage name is derived from the latter's real name, Scott Mescudi, combined with the name of a favorite uncle."]}
{"id": "Lil-Jon/Who-U-Wit%3F", "title": "Who U Wit", "artist": ["Lil Jon & The East Side Boyz"], "release_date": "2003-11-04", "genres": ["party rap", "rap", "club/dance", "dirty south", "electronic", "bass music"], "wikipedia_summary": ["Jonathan H. Smith (born January 17, 1971), better known by his stage name Lil Jon, is an American rapper and record producer. Regarded as a progenitor of the club-oriented hip-hop subgenre crunk, his production and voice presence were instrumental in the genre's commercial breakthrough in the early 2000s. He was also the frontman of the crunk group Lil Jon & the East Side Boyz, with whom he has released five albums.\nHaving been credited on most crunk releases throughout the 2000s, Lil Jon produced several of the genre's Billboard Hot 100 hits including \"Salt Shaker\" by Ying Yang Twins, \"Cyclone\" by Baby Bash, \"Damn!\" by YoungBloodZ, \"Freek-a-Leek\" by Petey Pablo, \"Goodies\" by Ciara, and \"Yeah!\" by Usher. The latter won Lil Jon a Grammy Award for Best Rap/Sung Performance as part of his five Grammy Award nominations. As a lead artist, three of his own singles — \"Lovers and Friends\" (with the East Side Boyz featuring Usher and Ludacris), \"Get Low\" (with the East Side Boyz featuring Ying Yang Twins), and \"Snap Yo Fingers\" (featuring E-40 and Sean P) — have peaked within the chart's top ten. His debut studio album, (2010), was met with lukewarm critical and commercial response.", "N/A"]}
{"id": "Barry-White/I%27m-Gonna-Love-You-Just-a-Little-More-Baby", "title": "I'm Gonna Love You Just a Little More, Baby", "artist": ["Barry White"], "release_date": "2003", "genres": ["70s", "easy listening", "disco", "2008 universal fire victim"], "wikipedia_summary": ["Barry Eugene White (né Carter; September 12, 1944 – July 4, 2003) was an American singer and songwriter. A two-time Grammy Award winner known for his bass voice and romantic image, his greatest success came in the 1970s as a solo singer and with the Love Unlimited Orchestra, crafting many enduring R&B, soul, funk, and disco songs such as his two biggest hits: \"Can't Get Enough of Your Love, Babe\" and \"You're the First, the Last, My Everything\".\nWhite recorded 20 studio albums during the course of his career, but multiple versions and compilations were released worldwide that were certified gold, 41 of which also attained platinum status. White had 20 gold and 10 platinum singles, with worldwide record sales in excess of 100 million records, and is one of the best-selling music artists of all time. His influences included James Cleveland, Ray Charles, Aretha Franklin, the Supremes, the Four Tops, and Marvin Gaye."]}
{"id": "East-of-Underground/I-Love-You", "title": "I love You", "artist": ["East of Underground"], "release_date": "2017-07-18", "genres": [], "wikipedia_summary": ["N/A"]}
{"id": "Ludwig-Van-Beethoven/Symphony-No.-9%3A-Ode-to-Joy", "title": "Symphony No. 9 Ode to Joy", "artist": ["Ludwig van Beethoven"], "release_date": "1993", "genres": ["classical", "european", "composer", "classical period"], "wikipedia_summary": ["Ludwig van Beethoven (baptised 17 December 1770 – 26 March 1827) was a German composer and pianist. He is one of the most revered figures in the history of Western music; his works rank among the most performed of the classical music repertoire and span the transition from the Classical period to the Romantic era in classical music. His early period, during which he forged his craft, is typically considered to have lasted until 1802. From 1802 to around 1812, his middle period showed an individual development from the styles of Joseph Haydn and Wolfgang Amadeus Mozart, and is sometimes characterised as heroic. During this time, Beethoven began to grow increasingly deaf. In his late period, from 1812 to 1827, he extended his innovations in musical form and expression."]}
{"id": "7th-Wonder/Daisy-Lady", "title": "Daisy Lady", "artist": ["7th Wonder"], "release_date": "1986", "genres": [], "wikipedia_summary": ["N/A"]}
{"id": "Sly-%26-the-Family-Stone/Sing-a-Simple-Song", "title": "Sing A Simple Song", "artist": ["Sly & the Family Stone"], "release_date": "N/A", "genres": ["rock and indie", "reggae", "dub"], "wikipedia_summary": ["Sly and Robbie were a prolific Jamaican rhythm section and production duo, associated primarily with the reggae and dub genres. Drummer Sly Dunbar and bassist Robbie Shakespeare teamed up in the mid-1970s after establishing themselves separately in Jamaica as professional musicians. Shakespeare died in December 2021 following kidney surgery."]}
{"id": "Beside/Change-the-Beat-(Female-Version)", "title": "Change the Beat (Female Version)", "artist": "Beside", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "The-Temptations/Ball-of-Confusion-(That%27s-What-the-World-Is-Today)", "title": "Ball of Confusion (That’s What the World Is Today)", "artist": ["The Temptations"], "release_date": "2008-08-23", "genres": ["funk", "motown", "contemporary r&b", "pop"], "wikipedia_summary": ["The Temptations is an American vocal group formed in Detroit, Michigan in 1961 as The Elgins, known for their string of successful singles and albums with Motown from the 1960s to the mid-1970s. The group's work with producer Norman Whitfield, beginning with the Top 10 hit single \"Cloud Nine\" in October 1968, pioneered psychedelic soul, and was significant in the evolution of R&B and soul music. The group members were known for their choreography, distinct harmonies, and dress style. Having sold tens of millions of albums, the Temptations are among the most successful groups in popular music.\nFeaturing five male vocalists and dancers (save for brief periods with fewer or more members), the group's founding members came from two rival Detroit vocal groups: Otis Williams, Elbridge \"Al\" Bryant, and Melvin Franklin of , and Eddie Kendricks and Paul Williams of . In 1964, Bryant was replaced by David Ruffin, who was the lead vocalist on a number of the group's biggest hits, including \"My Girl\" (1964), \"Ain't Too Proud to Beg\" (1966), and \"I Wish It Would Rain\" (1967). Ruffin was replaced in 1968 by Dennis Edwards, with whom the group continued to record hit records such as \"Cloud Nine\" (1968), \"I Can't Get Next to You\" (1969), and \"Ball of Confusion (That's What the World Is Today)\" (1970). Kendricks and Paul Williams both left the group in 1971, with subsequent members including Richard Street, Damon Harris, Glenn Leonard, Ron Tyson, and Ali-Ollie Woodson, the last of whom was the lead singer on late-period hit \"Treat Her Like a Lady\" in 1984 and the theme song for the children's movement program in 1987."]}
{"id": "DX-J-and-the-Bassonlians/Bassonlian-Attack", "title": "Bassonlian Attack", "artist": "DX-J and the Bassonlians", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Bruce Frederick Joseph Springsteen (born September 23, 1949) is an American rock singer, songwriter, and guitarist. Nicknamed \"the Boss\", Springsteen has released 21 studio albums spanning six decades; most of his albums feature the E Street Band, his backing band since 1972. Springsteen is a pioneer of heartland rock, combining commercially successful rock with poetic, socially conscious lyrics that reflect working class American life. He is known for his energetic concerts, some of which last more than four hours.\nSpringsteen released his first two albums, Greetings from Asbury Park, N.J. and The Wild, the Innocent & the E Street Shuffle, in 1973. Although both were well-received by critics, neither earned him a large audience. He changed his style and achieved worldwide popularity with Born to Run (1975). Springsteen followed with (1978) and (1980), Springsteen's first album to top the 200 chart. After the solo acoustic album (1982), he recorded (1984) with the E Street Band, which became his most commercially successful album and the 23rd-best selling album of all time as of 2024. All seven singles from reached the Top 10 of the Hot 100, including the title track. Springsteen mostly hired session musicians for the recording of his next three albums, (1987), (1992), and (1992). He reassembled the E Street Band for (1995), and recorded the acoustic album (1995) and the EP (1996) solo."]}
{"id": "Detroit-Emeralds/Baby-Let-Me-Take-You-(In-My-Arms)", "title": "Baby Let Me Take You In My Arms", "artist": ["Detroit Emeralds"], "release_date": "1996", "genres": ["classic pop and rock"], "wikipedia_summary": ["The Detroit Emeralds are an American R&B/soul vocal group, best known in the early 1970s. They enjoyed a run of successful records in the decade including their 1973 transatlantic hit single, \"Feel the Need in Me\"."]}
{"id": "Beastie-Boys/Hold-It-Now,-Hit-It", "title": "Hold It Now, Hit It", "artist": ["Beastie Boys"], "release_date": "1997", "genres": ["old-school rap", "golden age", "rap", "east coast rap"], "wikipedia_summary": ["The Beastie Boys were an American hip hop and rap rock group formed in New York City in 1979. They were composed of Adam \"Ad-Rock\" Horovitz (vocals, guitar), Adam \"MCA\" Yauch (vocals, bass), and Michael \"Mike D\" Diamond (vocals, drums). The Beastie Boys were formed out of members of experimental hardcore punk band the Young Aborigines, which was formed in 1979, with Diamond on drums, Jeremy Shatan on bass guitar, John Berry on guitar, and Kate Schellenbach later joining on percussion. When Shatan left New York City in mid-1981, Yauch replaced him on bass and the resulting band was named the Beastie Boys. Berry left shortly thereafter and was replaced by Horovitz.\nAfter achieving local success with the 1983 comedy hip hop single \"Cooky Puss\", the Beastie Boys made a full transition to hip hop, and Schellenbach left. They toured with Madonna in 1985 and a year later released their debut album, (1986), the first rap album to top the 200 chart. Their second album, (1989), composed almost entirely of samples, was a commercial failure that later received critical acclaim. (1992) and (1994) found mainstream success, followed by (1998), (2004), (2007), and (2011)."]}
{"id": "The-Honey-Drippers/Impeach-the-President", "title": "Impeach the President", "artist": ["The Honey Drippers"], "release_date": "2006", "genres": ["classic pop and rock"], "wikipedia_summary": ["N/A"]}
{"id": "Black-Sabbath/Iron-Man", "title": "Iron Man", "artist": ["Black Sabbath"], "release_date": "1998-10-19", "genres": ["classic metal", "heavy metal", "hard rock", "album rock", "pop/rock", "metal", "heavy metal_hard rock", "black metal", "british metal", "rock", "classic rock"], "wikipedia_summary": ["Black Sabbath are an English rock band formed in Birmingham in 1968 by guitarist Tony Iommi, drummer Bill Ward, bassist Geezer Butler, and vocalist Ozzy Osbourne. They are cited as pioneers of heavy metal music; the band helped define the genre with their first three albums Black Sabbath, Paranoid, and Master of Reality. In the 1980s and 1990s, the band underwent line-up changes, though since 1997 it has settled with the original band.\nAfter previous iterations of the group – the Polka Tulk Blues Band, and Earth – the band settled on the name Black Sabbath in 1969. They distinguished themselves through occult themes with horror-inspired lyrics and down-tuned guitars. Signing to Philips Records, they released their first single, a cover of the Crow song \"Evil Woman\", in January 1970, and their debut album, , the following month. Though it received negative reviews, it was a commercial success, leading to a follow-up record, . The band's popularity grew, and by 1973's , critics responded favourably. This album, along with its predecessor (1972) and successors (1975), (1976) and (1978), saw the band explore more experimental and progressive styles."]}
{"id": "Art-Clokey/Gumby-Theme-Song", "title": "Gumby Theme Song", "artist": "Art Clokey", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Various Artistsは、日本語ではヴァリアス・アーティスツ、ヴァリアス・アーティスト、V.A.などとも表記される英語の語句で、「様々なアーティストたち」を意味する表現。特に、アルバムなど音楽ソフトにおいて、多数のパフォーマーの作品を収録している場合などに用いられる。\nこの表現は、単に「様々なアーティストたち」によるパフォーマンスが収録されていることしか意味しないので、収録された音源の未発表/既発表といった区別とは関係がない。「編集アルバム」という意味に由来する「コンピレーション・アルバム」が、狭義では既発表音源を集めたものと理解され、多数のアーティストたちが新たに録音した未発表音源を集めたものについてはあまり用いられないのに対して、Various Artists はいずれの場合にも用いることがある表現である。"]}
{"id": "The-Mojo-Men/She%27s-My-Baby", "title": "She's My Baby", "artist": ["The Mojo Men"], "release_date": "1966", "genres": ["garage rock", "rock", "psychedelic rock"], "wikipedia_summary": ["The Mojo Men was an American rock band based in San Francisco. Formed in 1965, the group underwent several name and personnel changes until their 1969 breakup. Their highest-charting Billboard Hot 100 single was a cover of Buffalo Springfield's \"Sit Down, I Think I Love You\", which peaked at number 36 in 1967."]}
{"id": "Funkadelic/Get-Off-Your-Ass-and-Jam", "title": "Get Off Your Ass and Jam", "artist": ["Funkadelic"], "release_date": "1975-07", "genres": ["funk", "soul", "r&b", "p.funk"], "wikipedia_summary": ["Funkadelic was an American funk rock band formed in Plainfield, New Jersey in 1968 and active until 1982. As one of the two flagship groups of George Clinton's P-Funk collective, they helped pioneer the funk music culture of the 1970s. Funkadelic initially formed as a backing band for Clinton's vocal group the Parliaments (later the full-fledged band Parliament), but eventually pursued a heavier, psychedelic rock-oriented sound in their own recordings. They released acclaimed albums such as Maggot Brain (1971) and One Nation Under a Groove (1978)."]}
{"id": "Tony-Joe-White/Stud-Spider", "title": "Stud-Spider", "artist": ["Tony Joe White"], "release_date": "1994", "genres": ["rock", "bare necessities", "country"], "wikipedia_summary": ["Tony Joe White (July 23, 1943 – October 24, 2018), nicknamed the Swamp Fox, was an American singer-songwriter and guitarist, best known for his 1969 hit \"Polk Salad Annie\" and for \"Rainy Night in Georgia\", which he wrote but which was first made popular by Brook Benton in 1970. He also wrote \"Steamy Windows\" and \"Undercover Agent for the Blues\", both hits for Tina Turner in 1989; those two songs came by way of Turner's producer at the time, Mark Knopfler, who was a friend of White. \"Polk Salad Annie\" was also recorded by Joe Dassin, Elvis Presley, Joe Bonamassa and Tom Jones."]}
{"id": "The-Jackson-5/The-Boogie-Man", "title": "The Boogie Man", "artist": ["The Jackson 5"], "release_date": "1973-03", "genres": ["r&b", "soul", "disco", "pop", "motown"], "wikipedia_summary": ["The Jackson 5, later known as the Jacksons, are an American pop band composed of members of the Jackson family. The group was formed in Gary, Indiana in 1964, and originally consisted of brothers Jackie, Tito, Jermaine, Marlon, and Michael. They were managed by their father Joe Jackson. The group were among the first African American performers to attain a crossover following.\nThe Jackson 5 first performed in talent shows and clubs on the Chitlin' Circuit and eventually signed with Steeltown Records in 1967, under which their first two singles were released. In 1968, they left Steeltown and signed with Motown, where they were the first group to debut with four consecutive number-one hits on the Billboard Hot 100 chart with the songs \"I Want You Back\" (1969), \"ABC\", \"The Love You Save\", and \"I'll Be There\" (all 1970). They achieved seventeen Top 40 singles on the chart in five years, including six number-one R&B hits. The group left Motown for Epic Records in early 1976, with the exception of Jermaine, who was replaced by youngest brother Randy. Changing their name to the Jacksons upon signing with Epic, they released four studio albums and one live album between 1976 and 1981, including the successful albums (1978) and (1980) and singles \"Enjoy Yourself\" (1976), \"Shake Your Body (Down to the Ground)\" (1978), \"This Place Hotel\" (1980), and \"Can You Feel It\" (1981)."]}
{"id": "Icey-Jaye/It-Takes-a-Real-Man", "title": "It Takes a Real Man", "artist": "Icey Jaye", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "Bootsy%27s-Rubber-Band/Bootzilla", "title": "Bootzilla", "artist": ["Bootsy’s Rubber Band"], "release_date": "1999-04-12", "genres": [], "wikipedia_summary": ["N/A"]}
{"id": "2-Hyped-Brothers-%26-a-Dog/Doo-Doo-Brown", "title": "Doo Doo Brown", "artist": ["2 Hyped Brothers & A Dog"], "release_date": "1992", "genres": [], "wikipedia_summary": ["N/A"]}
{"id": "King-Tee/Bass-(Original)", "title": "Bass (original version)", "artist": ["King Tee"], "release_date": "1988", "genres": ["hip hop"], "wikipedia_summary": ["Roger McBride (born December 14, 1968), better known by his stage name King T (formerly known as King Tee), is an American West Coast hip hop rapper from Compton, California. Emerging as one of Compton's earliest hip hop artists, he was signed to Capitol Records, where he released his debut album Act a Fool in 1988 with the hit singles \"Act a Fool,\" \"Payback's A Mutha,\" \"The Coolest,\" and \"Bass” [Remix], all of which were considered hip-hop classics. In the late 1980s and early 1990s, he worked primarily with producer DJ Pooh, and was responsible for the rise of Tha Alkaholiks, whom he helped guide into the rap game. King T is also the CEO of his own record label, King T Inc."]}
{"id": "Luke/Face-Down,-Ass-Up", "title": "Face Down Ass Up", "artist": ["Luke", "The 2 Live Crew"], "release_date": "1990-07-13", "genres": ["southern rap", "hip hop", "party rap", "rap", "dirty rap", "club/dance", "electronic", "bass music"], "wikipedia_summary": ["Luther Roderick Campbell (born December 22, 1960), also known as Luke Skyywalker, Uncle Luke and simply Luke, is an American rapper, promoter, record executive, actor, and former leader of the rap group 2 Live Crew. He is known for having helped create the Miami bass genre, for establishing one of the first rap groups and rap labels in Southern hip hop, and his sexually crude call and response lyrics which were unique for the time period. He also starred in a short-lived show on VH1, Luke's Parental Advisory.", "2 Live Crew was an American hip hop group from Miami, Florida, formed in 1984. The group was originally composed of DJ Mr. Mixx (David Hobbs), Fresh Kid Ice (Christopher Wong Won), and Amazing Vee (Yuri Vielot), though its most well-known lineup emerged later with the addition of Brother Marquis (Mark Ross) and the replacement of Amazing Vee by Luther \"Luke Skyywalker\" Campbell, who also served as the group's manager and promoter. Known for their provocative lyrics and sexually explicit content, 2 Live Crew gained widespread attention in the late 1980s and early 1990s, becoming pioneers of the Miami bass genre and influential figures in the development of Southern hip hop. Their breakthrough album, The 2 Live Crew Is What We Are (1986), introduced their signature sound, blending booming basslines with humorous and risqué themes."]}
{"id": "Funkadelic/A-Joyful-Process", "title": "A Joyful Process", "artist": ["Funkadelic"], "release_date": "2004-05-11", "genres": ["funk", "soul", "soundtrack"], "wikipedia_summary": ["Funkadelic was an American funk rock band formed in Plainfield, New Jersey in 1968 and active until 1982. As one of the two flagship groups of George Clinton's P-Funk collective, they helped pioneer the funk music culture of the 1970s. Funkadelic initially formed as a backing band for Clinton's vocal group the Parliaments (later the full-fledged band Parliament), but eventually pursued a heavier, psychedelic rock-oriented sound in their own recordings. They released acclaimed albums such as Maggot Brain (1971) and One Nation Under a Groove (1978)."]}
{"id": "KC-%26-the-Sunshine-Band/That%27s-the-Way-(I-Like-It)", "title": "That's the Way I Like It", "artist": ["KC and the Sunshine Band"], "release_date": "2004", "genres": ["hip hop", "german", "trap", "rap"], "wikipedia_summary": ["Hüseyin Kökseçen (born 26 January 1988), better known as KC Rebell, is a German rapper of Kurdish descent. Based in Essen, Germany, he has an own label imprint \"Rebell Army\". He released six albums, four of which have peaked at number one on the German Albums Chart."]}
{"id": "Screamin%27-Jay-Hawkins/I-Put-a-Spell-on-You", "title": "I Put a Spell on You", "artist": ["Screamin’ Jay Hawkins"], "release_date": "1990", "genres": ["blues", "aln-sh", "singer-songwriter", "r&b"], "wikipedia_summary": ["Jalacy J. \"Screamin' Jay\" Hawkins (July 18, 1929 – February 12, 2000) was an American singer-songwriter, musician, actor, film producer, and boxer. Famed chiefly for his powerful, shouting vocal delivery and wildly theatrical performances of songs such as \"I Put a Spell on You\", he sometimes used macabre props onstage, making him an early pioneer of shock rock. He received a nomination for the Independent Spirit Award for Best Supporting Male for his performance in the 1989 indie film Mystery Train."]}
{"id": "Eric-B.-%26-Rakim/My-Melody", "title": "My Melody", "artist": ["Eric B. & Rakim"], "release_date": "1996-12-03", "genres": ["hip hop", "2008 universal fire victim"], "wikipedia_summary": ["Eric B. & Rakim were an American hip hop duo formed on Long Island, New York, in 1986, composed of DJ Eric B. and rapper Rakim. They first received acclaim for their 1987 debut album Paid in Full, which featured versions of the popular singles \"Eric B. Is President\" and the title track. They followed with three successful albums: Follow the Leader (1988), Let the Rhythm Hit 'Em (1990), and Don't Sweat the Technique (1992).\nAllMusic wrote that \"during rap's so-called golden age in the late '80s, Eric B. & Rakim were almost universally recognized as the premier DJ/MC team in all of hip-hop.\" Tom Terrell of NPR called them \"the most influential DJ/MC combo in contemporary pop music period.\""]}
{"id": "Rob-Base-%26-DJ-E-Z-Rock/Joy-and-Pain", "title": "Joy and Pain", "artist": ["Rob Base & D.J. E‐Z Rock"], "release_date": "1989", "genres": ["hip hop", "east coast hip hop"], "wikipedia_summary": ["N/A", "N/A"]}
{"id": "Martin-Lawrence/Wash-Yo%27-Ass", "title": "Wash Yo' Ass", "artist": ["Martin Lawrence"], "release_date": "1995", "genres": ["observational comedy", "black comedy", "ribaldry", "physical comedy"], "wikipedia_summary": ["Martin Fitzgerald Lawrence (born April 16, 1965) is an American actor and comedian. He came to fame during the 1990s, establishing a Hollywood career as a leading actor. He got his start playing Maurice Warfield in What's Happening Now!! (1987–1988), and is known for his lead performance in the Fox television sitcom Martin, as well as the Bad Boys film franchise. His other films include House Party, Boomerang, Life, Blue Streak, Big Momma's House, Open Season, and Wild Hogs."]}
{"id": "Louis-and-Bebe-Barron/Robby,-the-Cook,-and-60-Gallons-of-Booze", "title": "Robby, the Cook, and 60 Gallons of Booze", "artist": ["Louis and Bebe Barron"], "release_date": "1976", "genres": ["abstract electronic", "soundtrack", "electronic", "score"], "wikipedia_summary": ["Bebe Barron ((1925-06-16)June 16, 1925 – (2008-04-20)April 20, 2008) and Louis Barron ((1920-04-23)April 23, 1920 – (1989-11-01)November 1, 1989) were pioneers in the field of electronic music. The American couple is credited with writing the first electronic music for magnetic tape composed in the United States, and the first entirely electronic film score for the MGM movie Forbidden Planet (1956)."]}
{"id": "Richard-Pryor/Wino-Dealing-With-Dracula", "title": "Wino Dealing With Dracula", "artist": ["Richard Pryor"], "release_date": "2002-01-14", "genres": ["comedy", "standup comedy", "non-music"], "wikipedia_summary": ["Richard Franklin Lennox Thomas Pryor Sr. (December 1, 1940 – December 10, 2005) was an American stand-up comedian and actor. Known for reaching a broad audience with his trenchant observations and storytelling style, he is widely regarded as one of the greatest and most important stand-up comedians of all time. Pryor won a Primetime Emmy Award and five Grammy Awards. He received the first Kennedy Center Mark Twain Prize for American Humor in 1998. He won the Writers Guild of America Award in 1974. He was listed at number one on Comedy Central's list of all-time greatest stand-up comedians. In 2017, Rolling Stone ranked him first on its list of the 50 best stand-up comics of all time.\nPryor's body of work includes numerous concert films and recordings. He won the Grammy Award for Best Comedy Album for That Nigger's Crazy (1974), (1975), (1976), (1982), and (1983). He is also known for (1971), (1978), and (1979). Pryor served as a co-writer for the Mel Brooks satirical western comedy film (1974)."]}
{"id": "2-Live-Crew/Pop-That-Pussy", "title": "Pop That Pussy", "artist": ["The 2 Live Crew"], "release_date": "2008-09-16", "genres": ["hip hop", "miami bass"], "wikipedia_summary": ["2 Live Crew was an American hip hop group from Miami, Florida, formed in 1984. The group was originally composed of DJ Mr. Mixx (David Hobbs), Fresh Kid Ice (Christopher Wong Won), and Amazing Vee (Yuri Vielot), though its most well-known lineup emerged later with the addition of Brother Marquis (Mark Ross) and the replacement of Amazing Vee by Luther \"Luke Skyywalker\" Campbell, who also served as the group's manager and promoter. Known for their provocative lyrics and sexually explicit content, 2 Live Crew gained widespread attention in the late 1980s and early 1990s, becoming pioneers of the Miami bass genre and influential figures in the development of Southern hip hop. Their breakthrough album, The 2 Live Crew Is What We Are (1986), introduced their signature sound, blending booming basslines with humorous and risqué themes."]}
{"id": "Wolfgang-Amadeus-Mozart/Misericordias-Domini,-K.222", "title": "Misericordias Domini, K.222", "artist": "Wolfgang Amadeus Mozart", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Wolfgang Amadeus Mozart (27 January 1756 – 5 December 1791) was a prolific and influential composer of the Classical period. Despite his short life, his rapid pace of composition and proficiency from an early age resulted in more than 800 works representing virtually every Western classical genre of his time. Many of these compositions are acknowledged as pinnacles of the symphonic, concertante, chamber, operatic, and choral repertoires. Mozart is widely regarded as one of the greatest composers in the history of Western music, with his music admired for its \"melodic beauty, its formal elegance and its richness of harmony and texture\".\nBorn in Salzburg, Mozart showed prodigious ability from his earliest childhood. At age five, he was already competent on keyboard and violin, had begun to compose, and performed before European royalty. His father took him on a grand tour of Europe and then three trips to Italy. At 17, he was a musician at the Salzburg court but grew restless and travelled in search of a better position. Mozart's search for employment led to positions in Paris, Mannheim, Munich, and again in Salzburg, during which he wrote his five violin concertos, Sinfonia Concertante, and Concerto for Flute and Harp, as well as sacred pieces and masses, the motet , and the opera among other works."]}
{"id": "Ladi-Luv/Good-to-the-Last-Drop", "title": "Good to the Last Drop", "artist": "Ladi Luv", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "The-Notorious-B.I.G./Unbelievable", "title": "Unbelievable", "artist": ["The Notorious B.I.G."], "release_date": "1995", "genres": ["death by murder", "boom bap", "east coast hip hop", "gangsta rap"], "wikipedia_summary": ["Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names the Notorious B.I.G., Biggie Smalls, and Biggie, was an American rapper. Rooted in the New York rap scene and gangsta rap traditions, he is widely considered one of the greatest rappers of all time. Wallace became known for his distinctive, laidback lyrical delivery, offsetting his lyrics' often grim content. His music was usually semi-autobiographical, telling of hardship and criminality but also of debauchery and celebration.\nBorn and raised in Brooklyn, New York City, Wallace was the first artist to sign with Sean \"Puffy\" Combs's Bad Boy Records in 1993. That same year, he gained recognition for his guest appearances on other artists' singles. His debut studio album, Ready to Die (1994), received widespread critical acclaim and included signature tracks \"Juicy\" and \"Big Poppa\". This album made him the central figure in East Coast hip hop, helping to restore New York's prominence at a time when the West Coast was dominating the genre. In 1995, Wallace was named Rapper of the Year at the Music Awards. That same year, Wallace and his protégé group, Junior M.A.F.I.A.—which included longtime friends like Lil' Kim—released their debut album, (1995)."]}
{"id": "Junior-M.A.F.I.A./Get-Money", "title": "Get Money", "artist": ["Junior M.a.f.i.a.", "The Notorious B.I.G."], "release_date": "1996", "genres": ["death by murder", "hip hop", "boom bap", "east coast hip hop", "gangsta rap"], "wikipedia_summary": ["Junior M.A.F.I.A. was an American hip hop group from Bedford-Stuyvesant, Brooklyn, New York City. The backronym M.A.F.I.A. stands for Masters At Finding Intelligent Attitudes. They were formed and mentored by New York rapper The Notorious B.I.G. In 1995, they released their debut album, Conspiracy. The success of the group's singles \"Player's Anthem\" (U.S. #13) and \"Get Money\" (U.S. #17) helped launch the career of Lil' Kim as a solo artist.\nThe group disbanded shortly after the murder of the Notorious B.I.G., with Lil' Kim and Lil' Cease deciding to continue on with their solo careers. In 2005, three of the members (not including Lil' Kim) released a second album under the Junior M.A.F.I.A. name as a remembrance of the group.", "Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names the Notorious B.I.G., Biggie Smalls, and Biggie, was an American rapper. Rooted in the New York rap scene and gangsta rap traditions, he is widely considered one of the greatest rappers of all time. Wallace became known for his distinctive, laidback lyrical delivery, offsetting his lyrics' often grim content. His music was usually semi-autobiographical, telling of hardship and criminality but also of debauchery and celebration.\nBorn and raised in Brooklyn, New York City, Wallace was the first artist to sign with Sean \"Puffy\" Combs's Bad Boy Records in 1993. That same year, he gained recognition for his guest appearances on other artists' singles. His debut studio album, Ready to Die (1994), received widespread critical acclaim and included signature tracks \"Juicy\" and \"Big Poppa\". This album made him the central figure in East Coast hip hop, helping to restore New York's prominence at a time when the West Coast was dominating the genre. In 1995, Wallace was named Rapper of the Year at the Music Awards. That same year, Wallace and his protégé group, Junior M.A.F.I.A.—which included longtime friends like Lil' Kim—released their debut album, (1995)."]}
{"id": "Richard-Pryor/The-Back-Down", "title": "The Back Down", "artist": ["Richard Pryor"], "release_date": "2013-08-13", "genres": ["comedy"], "wikipedia_summary": ["Richard Franklin Lennox Thomas Pryor Sr. (December 1, 1940 – December 10, 2005) was an American stand-up comedian and actor. Known for reaching a broad audience with his trenchant observations and storytelling style, he is widely regarded as one of the greatest and most important stand-up comedians of all time. Pryor won a Primetime Emmy Award and five Grammy Awards. He received the first Kennedy Center Mark Twain Prize for American Humor in 1998. He won the Writers Guild of America Award in 1974. He was listed at number one on Comedy Central's list of all-time greatest stand-up comedians. In 2017, Rolling Stone ranked him first on its list of the 50 best stand-up comics of all time.\nPryor's body of work includes numerous concert films and recordings. He won the Grammy Award for Best Comedy Album for That Nigger's Crazy (1974), (1975), (1976), (1982), and (1983). He is also known for (1971), (1978), and (1979). Pryor served as a co-writer for the Mel Brooks satirical western comedy film (1974)."]}
{"id": "Lyn-Collins/Think-(About-It)", "title": "Think (About It)", "artist": ["Lyn Collins"], "release_date": "2004-10", "genres": ["rock and indie", "soul"], "wikipedia_summary": ["Gloria Lavern Collins (June 12, 1948 – March 13, 2005), better known as Lyn Collins, was an American soul singer best known for working with James Brown in the 1970s and for the influential 1972 funk single, \"Think (About It)\".\nA favorite among hip hop, R&B, and dance music producers for decades, Collins is by far the most sampled female artist of all time, with portions of her recordings used in well over 3,500 songs."]}
{"id": "Gang-Busters/The-Case-of-the-Ape-Bandit", "title": "The Case of the Ape Bandit", "artist": "Gang Busters", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Wolfgang Amadeus Mozart (27 January 1756 – 5 December 1791) was a prolific and influential composer of the Classical period. Despite his short life, his rapid pace of composition and proficiency from an early age resulted in more than 800 works representing virtually every Western classical genre of his time. Many of these compositions are acknowledged as pinnacles of the symphonic, concertante, chamber, operatic, and choral repertoires. Mozart is widely regarded as one of the greatest composers in the history of Western music, with his music admired for its \"melodic beauty, its formal elegance and its richness of harmony and texture\".\nBorn in Salzburg, Mozart showed prodigious ability from his earliest childhood. At age five, he was already competent on keyboard and violin, had begun to compose, and performed before European royalty. His father took him on a grand tour of Europe and then three trips to Italy. At 17, he was a musician at the Salzburg court but grew restless and travelled in search of a better position. Mozart's search for employment led to positions in Paris, Mannheim, Munich, and again in Salzburg, during which he wrote his five violin concertos, Sinfonia Concertante, and Concerto for Flute and Harp, as well as sacred pieces and masses, the motet , and the opera among other works."]}
{"id": "Kool-Moe-Dee/Go-See-the-Doctor", "title": "Go See the Doctor", "artist": ["Kool Moe Dee"], "release_date": "1987-08-14", "genres": ["hip hop", "underground hip hop", "golden age", "east coast rap", "rap"], "wikipedia_summary": ["Mohandas Dewese (born August 8, 1962), better known by his stage name Kool Moe Dee, is an American rapper, songwriter and actor. Considered one of the forerunners of the new jack swing sound in hip hop, he gained fame in the 1980s as a member of one of the pioneering groups in hip hop music, the Treacherous Three, and for his later solo career. During his career he released a total of seven studio albums (five of them solo), with 1994's Interlude being the last to date.\nHis fast and aggressive rap style influenced following rap figures such as Big Daddy Kane, Beastie Boys, KRS-One, Rakim, Will Smith, N.W.A, Tupac Shakur, Nas, Jay-Z, among others. Among his most famous songs are \"Go See the Doctor\", \"Wild Wild West\" and \"How Ya Like Me Now\"."]}
{"id": "112/Only-You", "title": "Only You", "artist": ["The Notorious B.I.G.", "112"], "release_date": "N/A", "genres": ["death by murder", "2000s", "boom bap", "contemporary r&b", "1990s", "east coast hip hop", "pop", "gangsta rap"], "wikipedia_summary": ["112 (pronounced \"one-twelve\") is an American R&B group from Atlanta, Georgia. Discovered by record production duo Tim & Bob, the group signed with Puff Daddy's Bad Boy Records, an imprint of Arista Records to release their eponymous debut studio album (1996). The following year, they guest performed alongside labelmate Faith Evans on Puff Daddy's 1997 single \"I'll Be Missing You,\" which won a Grammy Award for Best Rap Performance by a Duo or Group and became the first hip hop song to debut atop the Billboard Hot 100. The group then released their second and third albums Room 112 (1998) and Part III (2001); the latter peaked at number two on the Billboard 200. The group's fourth album, Hot & Wet (2003) served as their final release with Bad Boy until signing with Def Soul to release their fifth album Pleasure & Pain (2005), which saw continued commercial success. The albums spawned the Billboard Hot 100-top 20 singles including their debut, \"Only You\" (featuring the Notorious B.I.G.) as well as \"Cupid,\" \"Anywhere\" (featuring Lil' Zane), \"Love Me\" (featuring Mase), \"It's Over Now,\" and the Grammy Award-nominated \"Peaches & Cream.\"", "Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names the Notorious B.I.G., Biggie Smalls, and Biggie, was an American rapper. Rooted in the New York rap scene and gangsta rap traditions, he is widely considered one of the greatest rappers of all time. Wallace became known for his distinctive, laidback lyrical delivery, offsetting his lyrics' often grim content. His music was usually semi-autobiographical, telling of hardship and criminality but also of debauchery and celebration.\nBorn and raised in Brooklyn, New York City, Wallace was the first artist to sign with Sean \"Puffy\" Combs's Bad Boy Records in 1993. That same year, he gained recognition for his guest appearances on other artists' singles. His debut studio album, Ready to Die (1994), received widespread critical acclaim and included signature tracks \"Juicy\" and \"Big Poppa\". This album made him the central figure in East Coast hip hop, helping to restore New York's prominence at a time when the West Coast was dominating the genre. In 1995, Wallace was named Rapper of the Year at the Music Awards. That same year, Wallace and his protégé group, Junior M.A.F.I.A.—which included longtime friends like Lil' Kim—released their debut album, (1995)."]}
{"id": "Public-Enemy/Terminator-X-Speaks-With-His-Hands", "title": "Terminator X Speaks With His Hands", "artist": ["Public Enemy"], "release_date": "1987-06", "genres": ["conscious hip hop", "film soundtrack", "east coast hip hop", "hardcore hip hop"], "wikipedia_summary": ["Public Enemy is an American hip hop group formed in Roosevelt, New York in 1985 by Chuck D and Flavor Flav. The group rose to prominence for their political messages including subjects such as American racism and the American media. Their debut album, Yo! Bum Rush the Show, was released in 1987 to critical acclaim, and their second album, It Takes a Nation of Millions to Hold Us Back (1988), was the first hip hop album to top The Village Voice's Pazz & Jop critics' poll. Their next three albums, Fear of a Black Planet (1990), Apocalypse 91... The Enemy Strikes Black (1991), and Muse Sick-n-Hour Mess Age (1994), were also well received. The group has since released twelve more studio albums, including the soundtrack to the 1998 sports-drama film He Got Game and a collaborative album with Paris, Rebirth of a Nation (2006)."]}
{"id": "J.-Bodewalt-Lampe/Mysterioso-Pizzicato", "title": "Mysterioso Pizzicato", "artist": "J. Bodewalt Lampe", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Jens Bodewalt Lampe (November 8, 1869 – May 26, 1929) was a Danish-born American composer, arranger, performer and band-leader of ragtime and syncopated dance music.\nLampe was born in Ribe, Denmark to Christian and Sophia Lampe. In 1873, his family moved to St. Paul, Minnesota, where his father took over leadership of the Great Western Band. Lampe was a child prodigy on the violin and became the first chair violinist for the Minneapolis Symphony at age 16. He met and married his wife, Josephine, while receiving tuition in Chicago in 1888. In the early 1890s, he and his wife moved to Buffalo, where they had four children, Walter, Petra, Dorothy and Joseph Dell (known later as \"Dell\"). At this time, he began composing and publishing his own music and led a dance orchestra."]}
{"id": "Hoyt-Curtin/Meet-the-Flintstones", "title": "Meet the Flintstones", "artist": ["Hoyt Curtin"], "release_date": "2011-12-31", "genres": [], "wikipedia_summary": ["Hoyt Stoddard Curtin (September 9, 1922 – December 3, 2000) was an American composer, music producer and the primary musical director for Hanna-Barbera from its beginnings with The Ruff & Reddy Show from 1957 to 1965, and again from 1972 to 1986 until his retirement in 1989.\nCurtin composed many of the theme songs for Hanna-Barbera's cartoons, including The Flintstones, The Jetsons, The Huckleberry Hound Show, The Yogi Bear Show, Quick Draw McGraw, Top Cat, Jonny Quest, Space Ghost, Super Friends, Josie and the Pussycats, The Smurfs, and The New Scooby-Doo Movies. In 1960, Curtin also started composing the incidental music for many Hanna-Barbera animated series."]}
{"id": "The-Jimmy-Castor-Bunch/The-Return-of-Leroy-Pt.-1", "title": "The Return of Leroy, Pt. 1", "artist": ["The Jimmy Castor Bunch"], "release_date": "2022-11-11", "genres": ["r&b"], "wikipedia_summary": ["James Walter Castor (January 23, 1940[n1] – January 16, 2012) was an American funk, R&B and soul musician. He is credited with vocals, saxophone and composition. He is best known for songs such as \"It's Just Begun\", \"The Bertha Butt Boogie\", and his biggest hit single, the million-seller \"Troglodyte (Cave Man).\" Castor has been described as \"one of the most sampled artists in music history\" by the BBC."]}
{"id": "Bob-James/Take-Me-to-the-Mardi-Gras", "title": "Take Me to the Mardi Gras", "artist": ["Bob James"], "release_date": "2005", "genres": ["jazz", "jazz fusion", "jazz-funk", "contemporary jazz"], "wikipedia_summary": ["Robert McElhiney James (born December 25, 1939) is an American jazz keyboardist, arranger, and record producer. He founded the band Fourplay and wrote \"Angela\", the theme song for the TV show Taxi. According to VICE, music from his first seven albums has often been sampled and believed to have contributed to the formation of hip hop. Among his most well known recordings are \"Nautilus\", \"Westchester Lady\", \"Tappan Zee\", and his version of \"Take Me to the Mardi Gras\"."]}
{"id": "Doug-E.-Fresh/La-Di-Da-Di", "title": "La Di Da Di", "artist": ["Slick Rick", "Doug E. Fresh"], "release_date": "N/A", "genres": ["hip hop"], "wikipedia_summary": ["Douglas Davis (born September 17, 1966), known professionally as Doug E. Fresh, is a Barbadian-born American rapper, record producer, and beatboxer, also known as the \"Human Beat Box\". The pioneer of 20th-century American beatboxing, Fresh is able to accurately imitate drum machines and various special effects using only his mouth, lips, gums, throat, tongue and a microphone.\nIn the early 1980s he formed the Lover Boy Crew with DJs Chill Will and Barry B and later added rapper Slick Rick. Two of their songs \"The Show\" and \"La Di Da Di\" are considered early hip hop classics. \"La Di Da Di\", in particular, is one of the most sampled songs in music history.", "Richard Martin Lloyd Walters (born January 14, 1965), better known as Slick Rick, is an English-American rapper and record producer. He rose to prominence as part of Doug E. Fresh & the Get Fresh Crew in the mid-1980s. Their songs \"The Show\" and \"La Di Da Di\" are considered early hip hop classics. \"La Di Da Di\" is one of the most sampled songs in history.\nIn 1986, Slick Rick became the third artist to sign with Def Jam Recordings. He has released four albums with the label: The Great Adventures of Slick Rick (1988), The Ruler's Back (1991), Behind Bars (1994) and The Art of Storytelling (1999). His music has been sampled and interpolated over 1,000 times, in songs by artists including Eminem, Beyoncé, Mariah Carey, Beastie Boys, TLC, Nas, Miley Cyrus, Kanye West, MF DOOM, Czarface, Black Star, The Notorious B.I.G., Snoop Dogg, MC Ren, Montell Jordan, Tech N9ne, Lloyd, and Color Me Badd. In the process, Slick Rick has become one of the most-sampled hip-hop artists of all time. Many of these songs based on Slick Rick samples went on to become hit singles. He was one of the first hip-hop artists to be covered, when Snoop Dogg (then Snoop Doggy Dogg) rapped Rick's lyrics from his record \"La Di Da Di\" almost in their entirety on the track \"Lodi Dodi\" on his debut album in 1993. At the time, it was uncommon for rappers to record covers of each other's material."]}
{"id": "Rob-Base-%26-DJ-E-Z-Rock/It-Takes-Two", "title": "It Takes Two", "artist": ["Rob Base & DJ E‐Z Rock"], "release_date": "2006-03-27", "genres": ["hip hop", "east coast hip hop"], "wikipedia_summary": ["N/A"]}
{"id": "Billy-Stewart/Summertime", "title": "Summertime", "artist": ["Billy Stewart"], "release_date": "2005-11-07", "genres": ["rhythm & blues", "jazz pop", "2008 universal fire victim", "chicago soul"], "wikipedia_summary": ["William Larry Stewart II (March 24, 1937 – January 17, 1970) was an American R&B singer and pianist popular during the 1960s."]}
{"id": "Anquette/Shake-It-(Do-the-61st)", "title": "Shake It (Do the 61st)", "artist": ["Anquette"], "release_date": "2025-03-25", "genres": [], "wikipedia_summary": ["Anquette is an American contemporary R&B group from Miami, Florida, U.S. They debuted with their answer version of the 2 Live Crew's \"Throw the D\", titled \"Throw the P\" (1986). Anquette's debut LP Respect (1988) featured a version of Aretha Franklin's \"Respect\" as well as \"I Will Always Be There for You\", which peaked at #76 on Billboard's Hot R&B/Hip-Hop Singles and Tracks chart in 1989) and a rap track titled \"Janet Reno\". Other noteworthy tunes include \"Ghetto Style\" and \"Shake It (Do the 61st)\". Anquette came back in 1997 with the tune \"My Baby Mama,\" an answer rap to B-Rock and the Bizz's \"My Baby Daddy\"."]}
{"id": "The-Magic-Disco-Machine/Scratchin%27", "title": "Scratchin’", "artist": ["The Magic Disco Machine"], "release_date": "2013-03-25", "genres": [], "wikipedia_summary": ["N/A"]}
{"id": "Maze-Featuring-Frankie-Beverly/Joy-and-Pain", "title": "Joy and Pain", "artist": ["Maze featuring Frankie Beverly"], "release_date": "1981", "genres": ["hip hop rnb and dance hall", "r&b"], "wikipedia_summary": ["Maze, also known as Maze Featuring Frankie Beverly and Frankie Beverly & Maze, is an American soul band founded by Frankie Beverly in Philadelphia in 1970. Under its original name Raw Soul, the band moved to San Francisco and was introduced to Marvin Gaye. Gaye took the group on the road with him as one of his opening acts, and in 1976, he suggested that they change their name from Raw Soul.\nMaze released nine Gold albums from 1977 to 1993. Their well-known songs include \"Happy Feelings,\" \"While I'm Alone,\" \"Golden Time of Day,\" “Southern Girl,” \"The Look in Your Eyes,\" \"Joy and Pain,\" \"Before I Let Go,\" \"We Are One,\" \"Back in Stride,\" \"Can't Get Over You\" and \"The Morning After.\" The band has maintained a large and devoted following."]}
{"id": "Richard-%26-Willie/Emotional-Niggers", "title": "Emotional Niggers", "artist": "Richard & Willie", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Wilhelm Richard Wagner ( VAHG-nər; German: [ˈʁɪçaʁt ˈvaːɡnɐ] ; 22 May 1813 – 13 February 1883) was a German composer, theatre director, essayist, and conductor who is chiefly known for his operas (or, as some of his mature works were later known, \"music dramas\"). Unlike most opera composers, Wagner wrote both the libretto and the music for each of his stage works. Initially establishing his reputation as a composer of works in the romantic vein of Carl Maria von Weber and Giacomo Meyerbeer, Wagner revolutionised opera through his concept of the Gesamtkunstwerk (\"total work of art\"), whereby he sought to synthesise the poetic, visual, musical and dramatic arts, with music subsidiary to drama. The drama was to be presented as a continuously sung narrative, without conventional operatic structures like arias and recitatives. He described this vision in a series of essays published between 1849 and 1852. Wagner realised these ideas most fully in the first half of the 16-hour, four-opera cycle Der Ring des Nibelungen ( also known simply as )."]}
{"id": "Sylvia-Striplin/You-Can%27t-Turn-Me-Away", "title": "You Can’t Turn Me Away", "artist": ["Sylvia Striplin"], "release_date": "2000", "genres": ["soul"], "wikipedia_summary": ["Sylvia Striplin (March 1954 - March 2013) was a New York-based jazz, soul, and R&B vocalist. Sylvia was the youngest of five children. After a fire destroyed their home in the Sugar Hill section of Harlem, the family moved to the North Bronx in New York — there Sylvia honed her craft. Sylvia loved singing. She made up songs on the family piano and sang them around the house. She took piano lessons during her grade school years and performed in recitals. She began singing professionally with neighborhood friends Gus Falcon and Malcolm Ballinger as a teenager. After high school, Sylvia attended the City College of New York in Harlem where she was praised for her performance in the College's production of Anything Goes.\nDuring the 1970s, Sylvia found work as a backup singer. In the late 1970s she auditioned for the role of Dorothy in The Wiz and was selected as the second understudy with the New York Company. She was eventually selected to play Dorothy in the road company production, which traveled to Miami, Chicago, Los Angeles, and other cities, receiving excellent reviews along the way."]}
{"id": "2-Live-Crew/C%27mon-Babe", "title": "C’mon Babe", "artist": ["The 2 Live Crew"], "release_date": "1990", "genres": ["hip hop"], "wikipedia_summary": ["2 Live Crew was an American hip hop group from Miami, Florida, formed in 1984. The group was originally composed of DJ Mr. Mixx (David Hobbs), Fresh Kid Ice (Christopher Wong Won), and Amazing Vee (Yuri Vielot), though its most well-known lineup emerged later with the addition of Brother Marquis (Mark Ross) and the replacement of Amazing Vee by Luther \"Luke Skyywalker\" Campbell, who also served as the group's manager and promoter. Known for their provocative lyrics and sexually explicit content, 2 Live Crew gained widespread attention in the late 1980s and early 1990s, becoming pioneers of the Miami bass genre and influential figures in the development of Southern hip hop. Their breakthrough album, The 2 Live Crew Is What We Are (1986), introduced their signature sound, blending booming basslines with humorous and risqué themes."]}
{"id": "Zapp/More-Bounce-to-the-Ounce", "title": "More Bounce to the Ounce", "artist": ["Zapp"], "release_date": "1998-03-02", "genres": ["funk", "synth funk", "hip hop rnb and dance hall"], "wikipedia_summary": ["Zapp (also known as the Zapp Band, Zapp & Roger) is an American funk band that emerged from Dayton, Ohio, United States, in 1977. Particularly influential in the electro subgenre of funk, Zapp were known for their trademark use of the talk-box effect. The original line-up consisted of four Troutman brothers—frontman Roger, Larry, Lester and Terry—first cousin, Sherman Fleetwood—and non-Troutman family members Bobby Glover, Gregory Jackson, Jerome Derrickson, Eddie Barber, Jannetta Boyce and Shirley Murdock. Zapp also worked closely with George Clinton and Bootsy Collins of Parliament-Funkadelic during its early stages, their support being a factor in the group gaining a record deal with Warner Bros. Records in 1979."]}
{"id": "Kool-%26-the-Gang/Funky-Stuff", "title": "Funky Stuff/More Funky Stuff", "artist": ["Kool & the Gang"], "release_date": "1992", "genres": ["funk", "jazz", "contemporary r&b", "disco"], "wikipedia_summary": ["Kool & the Gang is an American R&B, soul, and funk band formed in Jersey City, New Jersey, in 1964. Its founding members include brothers Robert \"Kool\" Bell and Ronald Bell (also known as \"Khalis Bayyan\"), Dennis \"Dee Tee\" Thomas, Robert \"Spike\" Mickens, Charles Smith, George Brown, Woodrow \"Woody\" Sparrow, and Ricky Westfield. They have undergone numerous changes in personnel and have explored many musical styles throughout their history, including jazz, rhythm and blues, soul, funk, disco, rock, and pop music. The group changed their name several times. Settling on Kool & the Gang, the group signed to De-Lite Records and released their debut album Kool and the Gang in 1969.\nThe band's first mainstream success came with the release of their fourth album Wild and Peaceful (1973); it contained the US top-ten singles \"Jungle Boogie\" and \"Hollywood Swinging\". The band entered a period of decline before they reached a second commercial peak between 1979 and 1986 following their partnership with Brazilian musician and producer Eumir Deodato and the addition of singer James \"J.T.\" Taylor to the line-up. Their most successful albums of the time include (1979), (1980), and (1984), the latter being their highest-selling album, with two million copies sold in the US. Their hit singles during the period include \"Ladies' Night\" (1979), the US No. 1 \"Celebration\" (1980), \"Get Down on It\" (1981), \"Joanna\" (1983), \"Misled\" (1984), and \"Cherish\" (1985). The group has continued to perform worldwide, including as a supporting act for Van Halen in 2012 and their fiftieth-anniversary tour in 2014."]}
{"id": "Olympic-Runners/Put-the-Music-Where-Your-Mouth-Is", "title": "Put the Music Where Your Mouth Is", "artist": ["Olympic Runners"], "release_date": "1974", "genres": [], "wikipedia_summary": ["The Olympic Runners was een Britse funkband."]}
{"id": "Afrika-Bambaataa/Planet-Rock", "title": "Planet Rock", "artist": ["Afrika Bambaataa & Soulsonic Force"], "release_date": "N/A", "genres": ["afro-funk", "electro-funk", "1990s", "breakbeat"], "wikipedia_summary": ["Lance Taylor (born on April 17, 1957), also known as Afrika Bambaataa (), is a retired American DJ, rapper, and record producer. He is notable for releasing a series of genre-defining electro tracks in the 1980s that influenced the development of hip hop culture. Afrika Bambaataa is one of the originators of breakbeat DJing.\nThrough his co-opting of his street gang Black Spades into the music and culture-oriented organization Universal Zulu Nation, he has helped spread hip hop culture throughout the world. In May 2016, Bambaataa left his position as head of the \"Universal Zulu Nation\" due to multiple allegations of child sexual abuse dating as far back as the 1970s.", "Soulsonic Force (also referred to as Afrika Bambaataa & Soulsonic Force) is an American electro-funk and hip hop ensemble led by Afrika Bambaataa who helped establish hip-hop in the early 1980s with songs such as \"Planet Rock.\" They were also influential in the birth of the electro movement in America and helped pave the way for modern dance music styles such as electro-funk as well as the entire Miami bass scene."]}
{"id": "Uncle-Louie/I-Like-Funky-Music-(12-Remix)", "title": "I Like Funky Music", "artist": ["Uncle Louie"], "release_date": "2006", "genres": ["funk", "soul"], "wikipedia_summary": ["N/A"]}
{"id": "Chicago-Gangsters/Gangster-Boogie", "title": "Gangster Boogie", "artist": ["Chicago Gangsters"], "release_date": "1976", "genres": [], "wikipedia_summary": ["N/A"]}
{"id": "Kurtis-Blow/Christmas-Rappin%27", "title": "Christmas Rappin’", "artist": ["Kurtis Blow"], "release_date": "1997-11-17", "genres": ["hip hop", "electro", "disco rap", "east coast hip hop"], "wikipedia_summary": ["Kurtis Walker (born August 9, 1959), known professionally by his stage name Kurtis Blow, is an American rapper, songwriter, and record producer. Walker is the first commercially successful rapper and the first to sign with a major record label. \"The Breaks\", a single from his 1980 self-titled debut album, is the first certified gold record rap song. Over his career he released 17 albums. He is an ordained minister."]}
{"id": "James-Brown/Soul-Pride", "title": "Soul Pride", "artist": ["James Brown"], "release_date": "1989", "genres": ["blues", "christmas music", "disco", "film soundtrack"], "wikipedia_summary": ["James Joseph Brown (May 3, 1933 – December 25, 2006) was an American singer, songwriter, dancer, and musician. The central progenitor of funk music and a major figure of 20th-century music, he is referred to by various nicknames, among them \"Mr. Dynamite\", \"the Hardest-Working Man in Show Business\", \"Minister of New Super Heavy Funk\", \"Godfather of Soul\", \"King of Soul\", and \"Soul Brother No. 1\". In a career that lasted more than 50 years, he influenced the development of several music genres. Brown was one of the first ten inductees into the Rock and Roll Hall of Fame on January 23, 1986. His music has been heavily sampled by hip-hop musicians and other artists.\nBrown began his career as a gospel singer in Toccoa, Georgia. He rose to prominence in the mid-1950s as the lead singer of the Famous Flames, a rhythm and blues vocal group founded by Bobby Byrd. With the hit ballads \"Please, Please, Please\" and \"Try Me\", Brown built a reputation as a dynamic live performer with the Famous Flames and his backing band, sometimes known as the James Brown Band or the James Brown Orchestra. His success peaked in the 1960s with the live album and hit singles such as \"Papa's Got a Brand New Bag\", \"I Got You (I Feel Good)\" and \"It's a Man's Man's Man's World\"."]}
{"id": "James-Brown/Funky-Drummer", "title": "Funky Drummer", "artist": ["James Brown"], "release_date": "1991-05-07", "genres": ["funk", "funk soul", "soul", "r&b"], "wikipedia_summary": ["James Joseph Brown (May 3, 1933 – December 25, 2006) was an American singer, songwriter, dancer, and musician. The central progenitor of funk music and a major figure of 20th-century music, he is referred to by various nicknames, among them \"Mr. Dynamite\", \"the Hardest-Working Man in Show Business\", \"Minister of New Super Heavy Funk\", \"Godfather of Soul\", \"King of Soul\", and \"Soul Brother No. 1\". In a career that lasted more than 50 years, he influenced the development of several music genres. Brown was one of the first ten inductees into the Rock and Roll Hall of Fame on January 23, 1986. His music has been heavily sampled by hip-hop musicians and other artists.\nBrown began his career as a gospel singer in Toccoa, Georgia. He rose to prominence in the mid-1950s as the lead singer of the Famous Flames, a rhythm and blues vocal group founded by Bobby Byrd. With the hit ballads \"Please, Please, Please\" and \"Try Me\", Brown built a reputation as a dynamic live performer with the Famous Flames and his backing band, sometimes known as the James Brown Band or the James Brown Orchestra. His success peaked in the 1960s with the live album and hit singles such as \"Papa's Got a Brand New Bag\", \"I Got You (I Feel Good)\" and \"It's a Man's Man's Man's World\"."]}
{"id": "KC-%26-the-Sunshine-Band/I-Get-Lifted", "title": "I Get Lifted", "artist": ["KC and the Sunshine Band"], "release_date": "2002", "genres": ["pop soul", "trap", "hip hop", "rap", "soul", "disco", "german", "smooth soul"], "wikipedia_summary": ["Hüseyin Kökseçen (born 26 January 1988), better known as KC Rebell, is a German rapper of Kurdish descent. Based in Essen, Germany, he has an own label imprint \"Rebell Army\". He released six albums, four of which have peaked at number one on the German Albums Chart.", "George Warren McCrae Jr. (born October 19, 1944) is an American soul and disco singer who is most famous for his 1974 hit \"Rock Your Baby\"."]}
{"id": "The-5-Royales/Think", "title": "Think", "artist": ["The “5” Royales"], "release_date": "1978", "genres": ["doo-wop", "r&b"], "wikipedia_summary": ["The \"5\" Royales was an American rhythm and blues (R&B) vocal group from Winston-Salem, North Carolina that combined gospel, jump blues and doo-wop, marking an early and influential step in the evolution of rock and roll. Most of their big R&B hits were recorded in 1952 and 1953 and written by the guitarist Lowman \"Pete\" Pauling.\nCover versions of the band's songs hit the Top 40, including \"Dedicated to the One I Love\" (the Shirelles and the Mamas & the Papas), \"Tell the Truth\" (Ray Charles and Ike & Tina Turner), and \"Think\" (James Brown & The Famous Flames). Brown modeled his first vocal group after the \"5\" Royales, and both Eric Clapton and Stax guitarist Steve Cropper cited Pauling as a key influence. The Rolling Stones singer Mick Jagger covered \"Think\" on his 1993 solo album ."]}
{"id": "Hank-Williams/Hey,-Good-Lookin%27", "title": "Hey Good Lookin'", "artist": ["Hank Williams"], "release_date": "N/A", "genres": ["funk", "video game music", "stage & screen", "traditional country", "contemporary pop/rock", "soundtracks", "urban", "alternative/indie rock", "alternative pop/rock"], "wikipedia_summary": ["Hiram King \"Hank\" Williams (September 17, 1923 – January 1, 1953) was an American singer, songwriter, and musician. An early pioneer of country music, he is regarded as one of the most significant and influential musicians of the 20th century. Williams recorded 55 singles that reached the top 10 of the Billboard Country & Western Best Sellers chart, five of which were released posthumously, and 12 of which reached No.1.\nBorn and raised in Alabama, Williams learned guitar from African-American blues musician Rufus Payne. Both Payne and Roy Acuff significantly influenced his musical style. After winning an amateur talent contest, Williams began his professional career in Montgomery in the late 1930s playing on local radio stations and at area venues such as school houses, movie theaters, and bars. He formed the Drifting Cowboys backup band, which was managed by his mother, and dropped out of school to devote his time to his career. Because his alcoholism made him unreliable, he was fired and rehired several times by radio station WSFA, and had trouble replacing several of his band members who were drafted during World War II."]}
{"id": "Tony!-Toni!-Ton%C3%A9!/Feels-Good", "title": "Feels Good", "artist": ["Tony! Toni! Toné!"], "release_date": "1991-05-08", "genres": ["funk", "rnb swing", "r&b", "soul", "pop"], "wikipedia_summary": ["Tony! Toni! Toné! is an American R&B/Soul band from Oakland, California, popular during the late 1980s to mid-1990s. During the band's heyday, it was composed of D'Wayne Wiggins on lead vocals and guitar, his brother Raphael Saadiq (born Charles Ray Wiggins) on lead vocals and bass, and their cousin Timothy Christian Riley on drums, keyboards, and background vocals. Originally, the band went by \"Tony, Toni, Toné\" as a joke, until they realized it \"had a nice ring to it\".\nAfter a stint as musicians on Prince's Parade Tour in 1986, the trio formed Tony! Toni! Toné! back in their hometown of Oakland that same year. The band first found success performing around the San Francisco Bay Area. They released their debut album Who? in 1988. Their debut single, “Little Walter,” reached No. 1 on the Billboard R&B chart; three more singles from the album reached the Top 10; and the album was certified gold."]}
{"id": "The-Meters/Just-Kissed-My-Baby", "title": "Just Kissed My Baby", "artist": ["The Meters"], "release_date": "2021", "genres": ["funk"], "wikipedia_summary": ["The Meters (later The Funky Meters) are an American funk band formed in 1965 in New Orleans by Zigaboo Modeliste (drums), George Porter Jr. (bass), Leo Nocentelli (guitar) and Art Neville (keyboards). The band performed and recorded their own music from the late 1960s until 1977 and played an influential role as backing musicians for other artists, including Lee Dorsey, Robert Palmer, Dr. John, and Allen Toussaint. Their original songs \"Cissy Strut\" and \"Look-Ka Py Py\" are considered funk classics.\nWhile they rarely enjoyed significant mainstream success, they are considered originators of funk along with artists like James Brown, and their work is influential on many other bands, both their contemporaries and modern musicians. Their sound is defined by a combination of tight melodic grooves and syncopated New Orleans \"second line\" rhythms under highly charged guitar and keyboard riffing. The band has been nominated four times for induction into the Rock and Roll Hall of Fame, most recently in 2017. In 2018 the band was presented with the Grammy Lifetime Achievement Award."]}
{"id": "Michael-Jackson/Don%27t-Stop-%27Til-You-Get-Enough", "title": "Don’t Stop ’til You Get Enough", "artist": ["Michael Jackson"], "release_date": "2016-03-25", "genres": ["dance-pop", "boogie", "contemporary r&b", "american"], "wikipedia_summary": ["Michael Joseph Jackson (August 29, 1958 – June 25, 2009) was an American singer, songwriter, dancer, and philanthropist. Dubbed the \"King of Pop\", he is regarded as one of the most significant figures of the 20th century. Over a four-decade career, his world record music achievements broke racial barriers in America and made him a global figure. Through songs, stages, and fashion, he proliferated visual performance for artists in popular music; popularizing street dance moves including the moonwalk (which he named), the robot, and the anti-gravity lean. Jackson is often deemed the greatest entertainer of all time based on his acclaim and records.\nThe eighth child of the Jackson family, Michael made his public debut in 1964 at age six, as a member of the Jackson 5 (later known as the Jacksons). After signing with Motown in 1968, the band achieved worldwide success with him as its lead singer. Jackson achieved solo stardom with the release of his fifth album (1979). He followed it up with (1982), the best-selling album of all time, which propelled him to the forefront of pop culture and revolutionized the music video medium with the videos for its title track along with \"Beat It\" and \"Billie Jean\". Jackson furthered his position as a global superstar with (1987), the first album to produce five US Hot 100 number-one singles: \"I Just Can't Stop Loving You\", \"Bad\", \"The Way You Make Me Feel\", \"Man in the Mirror\", and \"Dirty Diana\". (1991) marked a new era for Jackson, lauded as his most artistic and socially conscious album. (1995) produced \"You Are Not Alone\", the first song to debut at number one on the US Hot 100, as well as the protest songs \"Earth Song\" and \"They Don't Care About Us\". His final album, , was released in 2001."]}
{"id": "Brass-Construction/Get-Up-to-Get-Down", "title": "Get Up To Get Down", "artist": ["Brass Construction"], "release_date": "1979-11-01", "genres": ["funk"], "wikipedia_summary": ["Brass Construction was an American funk group formed in Brooklyn, New York, United States, in 1968. They were originally known as Dynamic Soul, and went on to record a string of hit singles and albums through 1985."]}
{"id": "Public-Enemy/M.P.E.", "title": "M.P.E.", "artist": ["Public Enemy"], "release_date": "1987-02-10", "genres": ["hip hop", "golden age", "political rap", "east coast rap", "east coast hip hop", "hip hop rap", "rap", "conscious hip hop", "hardcore rap", "rock"], "wikipedia_summary": ["Public Enemy is an American hip hop group formed in Roosevelt, New York in 1985 by Chuck D and Flavor Flav. The group rose to prominence for their political messages including subjects such as American racism and the American media. Their debut album, Yo! Bum Rush the Show, was released in 1987 to critical acclaim, and their second album, It Takes a Nation of Millions to Hold Us Back (1988), was the first hip hop album to top The Village Voice's Pazz & Jop critics' poll. Their next three albums, Fear of a Black Planet (1990), Apocalypse 91... The Enemy Strikes Black (1991), and Muse Sick-n-Hour Mess Age (1994), were also well received. The group has since released twelve more studio albums, including the soundtrack to the 1998 sports-drama film He Got Game and a collaborative album with Paris, Rebirth of a Nation (2006)."]}
{"id": "R.-Kelly/Your-Body%27s-Callin%27", "title": "Your Body's Callin'", "artist": ["R. Kelly"], "release_date": "1994-12-08", "genres": ["gospel", "hip hop soul", "contemporary r&b", "criminal"], "wikipedia_summary": ["Robert Sylvester Kelly (born January 8, 1967), known as R. Kelly, is an American former singer, songwriter, and record producer. He is credited with prolific commercial success in R&B, hip hop, and pop music recordings, earning nicknames such as \"the King of R&B\", \"the King of Pop-Soul\", and \"the Pied Piper of R&B\". Kelly's career ended in 2019 following his arrest and subsequent convictions on federal racketeering and sex trafficking charges involving sexual abuse of minors.\nBorn on the South Side of Chicago, Illinois, Kelly began performing in the subway under the Chicago \"L\" tracks, and regularly busked at the \"L\" stop on the Red Line's Jackson station in the Loop. During his recording career, Kelly released 18 studio albums which yielded a number of hit singles, including \"I Believe I Can Fly\", \"Bump N' Grind\", \"Your Body's Callin', \"Fiesta (Remix)\", \"Ignition (Remix)\", \"Step in the Name of Love (Remix)\", \"If I Could Turn Back the Hands of Time\", \"The World's Greatest\", \"I'm a Flirt (Remix)\", and the hip hopera . In 1998, he won three Grammy Awards for \"I Believe I Can Fly\". Alongside his recording career, Kelly's songwriting and production work was credited on albums by Michael Jackson, Britney Spears, Whitney Houston, Mariah Carey, Celine Dion, Justin Bieber, Janet Jackson, Chris Brown, Aaliyah, Usher, Ciara, Toni Braxton, Luther Vandross, and Mary J. Blige. Kelly received a Grammy Award nomination for his contributions to Jackson's 1995 single, \"You Are Not Alone\", which earned a as the first song to debut atop the Hot 100 in the chart's history. Kelly's 1998 collaboration with Dion, \"I'm Your Angel\", did so once more."]}
{"id": "Jungle-Brothers/I%27ll-House-You", "title": "I'll House You", "artist": ["Jungle Brothers"], "release_date": "1988", "genres": ["hip hop", "rock and indie", "east coast hip hop"], "wikipedia_summary": ["Jungle Brothers are an American hip hop trio composed of Michael Small (Mike Gee), Nathaniel Hall (Afrika Baby Bam) and Sammy Burwell (DJ Sammy B). Hailed as pioneers of the fusion of jazz, hip-hop, and house music, they were the first hip-hop group to collaborate with a house-music producer. The trio released their debut album, Straight out the Jungle in July 1988. Their hip-house club hit single, \"I'll House You\" was added to the album in late-1988 reissues. Fostered by Kool DJ Red Alert, the Jungle Brothers' success paved the way for De La Soul, A Tribe Called Quest, and eventually the Native Tongues collective that they founded."]}
{"id": "Public-Enemy/Timebomb", "title": "Timebomb", "artist": ["Public Enemy"], "release_date": "1987-02-10", "genres": ["hip hop", "golden age", "political rap", "east coast rap", "east coast hip hop", "hip hop rap", "rap", "conscious hip hop", "hardcore rap", "rock"], "wikipedia_summary": ["Public Enemy is an American hip hop group formed in Roosevelt, New York in 1985 by Chuck D and Flavor Flav. The group rose to prominence for their political messages including subjects such as American racism and the American media. Their debut album, Yo! Bum Rush the Show, was released in 1987 to critical acclaim, and their second album, It Takes a Nation of Millions to Hold Us Back (1988), was the first hip hop album to top The Village Voice's Pazz & Jop critics' poll. Their next three albums, Fear of a Black Planet (1990), Apocalypse 91... The Enemy Strikes Black (1991), and Muse Sick-n-Hour Mess Age (1994), were also well received. The group has since released twelve more studio albums, including the soundtrack to the 1998 sports-drama film He Got Game and a collaborative album with Paris, Rebirth of a Nation (2006)."]}
{"id": "The-Notorious-B.I.G./The-What", "title": "The What", "artist": ["The Notorious B.I.G.", "Method Man"], "release_date": "2011", "genres": ["death by murder", "hardcore hip hop", "boom bap", "east coast hip hop", "gangsta rap", "film soundtrack"], "wikipedia_summary": ["Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names the Notorious B.I.G., Biggie Smalls, and Biggie, was an American rapper. Rooted in the New York rap scene and gangsta rap traditions, he is widely considered one of the greatest rappers of all time. Wallace became known for his distinctive, laidback lyrical delivery, offsetting his lyrics' often grim content. His music was usually semi-autobiographical, telling of hardship and criminality but also of debauchery and celebration.\nBorn and raised in Brooklyn, New York City, Wallace was the first artist to sign with Sean \"Puffy\" Combs's Bad Boy Records in 1993. That same year, he gained recognition for his guest appearances on other artists' singles. His debut studio album, Ready to Die (1994), received widespread critical acclaim and included signature tracks \"Juicy\" and \"Big Poppa\". This album made him the central figure in East Coast hip hop, helping to restore New York's prominence at a time when the West Coast was dominating the genre. In 1995, Wallace was named Rapper of the Year at the Music Awards. That same year, Wallace and his protégé group, Junior M.A.F.I.A.—which included longtime friends like Lil' Kim—released their debut album, (1995).", "Clifford Smith, Jr. (born March 2, 1971), better known by his stage name Method Man, is an American rapper, record producer, and actor. He is a member of the East Coast hip hop collective Wu-Tang Clan, and is half of the hip hop duo Method Man & Redman. His debut solo album, Tical (1994), peaked at number four on the Billboard 200 and spawned the single \"I'll Be There for You/You're All I Need to Get By\" (featuring Mary J. Blige), which won Best Rap Performance by a Duo or Group at the 38th Annual Grammy Awards. The song also peaked within the top five of the Billboard Hot 100; he and Blige later starred in Power Book II: Ghost, a spin-off of Power.\nMethod Man has appeared in films such as 187 (1997), Belly (1998), How High (2001), Garden State (2004), The Wackness (2008), Venom (2005), (2012), (2016), and (2014). He and Redman co-starred on the short-lived Fox television sitcom . He has also had recurring roles in three HBO series, as Tug Daniels in , Melvin \"Cheese\" Wagstaff in , and Rodney in . Method Man also appeared in the TBS comedy series ."]}
{"id": "Fat-Boys/Stick-%27Em", "title": "Stick ’em", "artist": ["Fat Boys"], "release_date": "N/A", "genres": ["hip hop", "old school hip hop", "east coast hip hop", "beatboxing"], "wikipedia_summary": ["The Fat Boys were an American hip hop trio from Brooklyn, New York, who emerged in the early 1980s. The group was briefly known originally as the Disco 3, originally composed of Mark \"Prince Markie Dee\" Morales, Damon \"Kool Rock-Ski\" Wimbley, and Darren \"Buff Love\" Robinson.\nThe trio is widely known for using beatbox in their songs. The group opened doors for beatboxers like Biz Markie and Doug E. Fresh. The Fat Boys were one of the first rap groups to release full-length rap albums, along with Run-D.M.C., Whodini and Kurtis Blow. Beloved for their comedic, self-deprecating rhymes, the group released seven studio albums, four of which went Gold by RIAA."]}
{"id": "Quincy-Jones/Snow-Creatures", "title": "Snow Creatures", "artist": ["Quincy Jones"], "release_date": "1972-03", "genres": ["classic pop and rock", "big band", "american", "2008 universal fire victim"], "wikipedia_summary": ["Quincy Delight Jones Jr. (March 14, 1933 – November 3, 2024) was an American record producer, composer, arranger, conductor, trumpeter, and bandleader. Over the course of his seven-decade career, he received many accolades including 28 Grammy Awards, a Primetime Emmy Award, and a Tony Award as well as nominations for seven Academy Awards and four Golden Globe Awards.\nJones came to prominence in the 1950s as a jazz arranger and conductor before producing pop hit records for Lesley Gore in the early 1960s (including \"It's My Party\") and serving as an arranger and conductor for several collaborations between Frank Sinatra and the jazz artist Count Basie. Jones produced three of the most successful albums by Michael Jackson: Off the Wall (1979), Thriller (1982), and Bad (1987). In 1985, Jones produced and conducted the charity song \"We Are the World\", which raised funds for victims of famine in Ethiopia."]}
{"id": "Run-DMC/Here-We-Go-(Live-at-the-Funhouse)", "title": "Here We Go (Live at the Funhouse)", "artist": "Run-DMC", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Run-DMC (also formatted Run-D.M.C., RUN DMC, or some combination thereof) was an American hip-hop group formed in Hollis, Queens, New York City in 1983 by Joseph Simmons, Darryl McDaniels, and Jason Mizell. Run-DMC is regarded as one of the most influential acts in the history of hip-hop culture and especially one of the most famous hip-hop acts of the 1980s. Along with Beastie Boys, LL Cool J, DJ Jazzy Jeff & the Fresh Prince, and Public Enemy, the group pioneered new-school hip-hop music and helped usher in the golden age hip-hop. The group was among the first to highlight the importance of the MC and DJ relationship.\nWith the release of Run-D.M.C. (1984), Run-DMC became the first hip-hop group to achieve a Gold record. Run-D.M.C. was followed with the certified Platinum record (1985), making Run-DMC the first hip-hop group to go platinum. (1986) became the first multi-platinum hip-hop record. Run-DMC's cover of \"Walk This Way\", featuring the group Aerosmith, charted higher on the Hot 100 than Aerosmith's original version, peaking at number four. It became one of the best-known songs in both hip-hop and rock. Run-DMC was the first hip-hop act to have their music videos broadcast on MTV, appear on , be on the cover of , perform at Live Aid, and be nominated for a Grammy Award."]}
{"id": "King-Tee/Payback%27s-a-Mutha", "title": "Payback’s a Mutha", "artist": ["King Tee"], "release_date": "1988", "genres": ["hip hop", "west coast hip hop"], "wikipedia_summary": ["Roger McBride (born December 14, 1968), better known by his stage name King T (formerly known as King Tee), is an American West Coast hip hop rapper from Compton, California. Emerging as one of Compton's earliest hip hop artists, he was signed to Capitol Records, where he released his debut album Act a Fool in 1988 with the hit singles \"Act a Fool,\" \"Payback's A Mutha,\" \"The Coolest,\" and \"Bass” [Remix], all of which were considered hip-hop classics. In the late 1980s and early 1990s, he worked primarily with producer DJ Pooh, and was responsible for the rise of Tha Alkaholiks, whom he helped guide into the rap game. King T is also the CEO of his own record label, King T Inc."]}
{"id": "Original-Concept/Pump-That-Bass", "title": "Pump That Bass", "artist": ["Original Concept"], "release_date": "N/A", "genres": [], "wikipedia_summary": ["Original Concept was an American 1980s hip-hop group from Long Island, New York, best known for their single \"Can You Feel It\"."]}
{"id": "Run-DMC/Hit-It-Run", "title": "Hit It Run", "artist": "Run-DMC", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Run-DMC (also formatted Run-D.M.C., RUN DMC, or some combination thereof) was an American hip-hop group formed in Hollis, Queens, New York City in 1983 by Joseph Simmons, Darryl McDaniels, and Jason Mizell. Run-DMC is regarded as one of the most influential acts in the history of hip-hop culture and especially one of the most famous hip-hop acts of the 1980s. Along with Beastie Boys, LL Cool J, DJ Jazzy Jeff & the Fresh Prince, and Public Enemy, the group pioneered new-school hip-hop music and helped usher in the golden age hip-hop. The group was among the first to highlight the importance of the MC and DJ relationship.\nWith the release of Run-D.M.C. (1984), Run-DMC became the first hip-hop group to achieve a Gold record. Run-D.M.C. was followed with the certified Platinum record (1985), making Run-DMC the first hip-hop group to go platinum. (1986) became the first multi-platinum hip-hop record. Run-DMC's cover of \"Walk This Way\", featuring the group Aerosmith, charted higher on the Hot 100 than Aerosmith's original version, peaking at number four. It became one of the best-known songs in both hip-hop and rock. Run-DMC was the first hip-hop act to have their music videos broadcast on MTV, appear on , be on the cover of , perform at Live Aid, and be nominated for a Grammy Award."]}
{"id": "Audio-Fidelity-Records/Two-at-a-Time", "title": "Two at a Time", "artist": "Audio Fidelity Records", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "Force-M.D.%27s/Itchin%27-for-a-Scratch", "title": "Itchin’ for a Scratch", "artist": ["Force M.D.’s"], "release_date": "2023-08-11", "genres": ["classic pop and rock", "r&b"], "wikipedia_summary": ["The Force M.D.s are an American R&B vocal group that was formed in 1981 in Staten Island, New York. Although the group has old school hip hop roots, it is perhaps best known for their soulful R&B tunes such as \"Tender Love,\" \"Love Is a House,\" \"Tears,\" and \"Here I Go Again.\" They are considered major forerunners of the new jack swing movement."]}
{"id": "LL-Cool-J/I-Can%27t-Live-Without-My-Radio", "title": "I Can’t Live Without My Radio", "artist": ["LL Cool J"], "release_date": "1999-10-12", "genres": ["hip hop", "rap", "east coast hip hop"], "wikipedia_summary": ["James Todd Smith (born January 14, 1968), known professionally as LL Cool J (short for Ladies Love Cool James), is an American rapper and actor. He is one of the earliest rappers to achieve commercial success, alongside fellow new school hip hop acts Beastie Boys and Run-DMC.\nSigned to Def Jam Recordings in 1984, LL Cool J's breakthrough came with his single \"I Need a Beat\" and his landmark debut album, Radio (1985). He achieved further commercial and critical success with the albums Bigger and Deffer (1987), Walking with a Panther (1989), Mama Said Knock You Out (1990), Mr. Smith (1995), and Phenomenon (1997). His twelfth album, Exit 13 (2008), was his last in his long-tenured deal with Def Jam. He later re-signed with the label and released his fourteenth album, The FORCE (2024)."]}
{"id": "Sugar-Bear/Don%27t-Scandalize-Mine", "title": "Don't Scandalize Mine", "artist": ["Sugar Bear"], "release_date": "2002-02-25", "genres": [], "wikipedia_summary": ["N/A"]}
{"id": "Lovebug-Starski/Starski-Live-at-the-Disco-Fever", "title": "Starski Live at the Disco Fever", "artist": ["Lovebug Starski"], "release_date": "1982", "genres": ["hip hop"], "wikipedia_summary": ["Kevin Smith (May 16, 1960 – February 8, 2018), best known by his stage name Lovebug Starski, was an American MC, musician, and record producer. He began his career as a record boy in 1971 as hip hop first appeared in the Bronx, and he eventually became a DJ at the Disco Fever club in 1978. He is one of two people who may have come up with the term \"hip-hop\". Starski claimed that he coined the phrase, while trading the two words back and forth, while improvising lines with Keef Cowboy of Grandmaster Flash and the Furious Five, at a farewell party for a friend who was headed into the Army. In an interview with Dave Hill in the newspaper The Observer, Starski explained, \"I picked up the mic and just started saying 'a hip hop, hip hop, de hibbyhibbyhibbyhibby hop'. The people couldn't believe it but it stuck.\""]}
{"id": "Eric-B.-%26-Rakim/I-Know-You-Got-Soul", "title": "I Know You Got Soul", "artist": ["Eric B. & Rakim"], "release_date": "2004", "genres": ["hip hop", "2008 universal fire victim"], "wikipedia_summary": ["Eric B. & Rakim were an American hip hop duo formed on Long Island, New York, in 1986, composed of DJ Eric B. and rapper Rakim. They first received acclaim for their 1987 debut album Paid in Full, which featured versions of the popular singles \"Eric B. Is President\" and the title track. They followed with three successful albums: Follow the Leader (1988), Let the Rhythm Hit 'Em (1990), and Don't Sweat the Technique (1992).\nAllMusic wrote that \"during rap's so-called golden age in the late '80s, Eric B. & Rakim were almost universally recognized as the premier DJ/MC team in all of hip-hop.\" Tom Terrell of NPR called them \"the most influential DJ/MC combo in contemporary pop music period.\""]}
{"id": "Herman-Kelly-%26-Life/Dance-to-the-Drummer%27s-Beat", "title": "Dance to the Drummer’s Beat", "artist": ["Herman Kelly & Life"], "release_date": "1997-08-19", "genres": [], "wikipedia_summary": ["N/A"]}
{"id": "Commodores/The-Assembly-Line", "title": "The Assembly Line", "artist": ["Commodores"], "release_date": "1987", "genres": ["funk", "pop soul", "adult contemporary", "disco"], "wikipedia_summary": ["Commodores, often billed as The Commodores, is an American funk and soul group. The group's most successful period was in the late 1970s and early 1980s when Lionel Richie was the co-lead singer.\nThe members of the group met as mostly freshmen at Tuskegee Institute (now Tuskegee University) in 1968, and signed with Motown in November 1972, having first caught the public eye opening for the Jackson 5 while on tour.\nThe band's biggest hit singles are ballads such as \"Easy\", \"Three Times a Lady\", and \"Nightshift\"; and funk-influenced dance songs, including \"Brick House\", \"Fancy Dancer\", \"Lady (You Bring Me Up)\", and \"Too Hot ta Trot\"."]}
{"id": "Private-Willie-Duckworth/Sound-Off-(The-Duckworth-Chant)", "title": "Sound Off (The Duckworth Chant)", "artist": "Private Willie Duckworth", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Willie Hugh Nelson (born April 29, 1933) is an American singer, guitarist and songwriter. He was one of the main figures of the outlaw country subgenre that developed in the late 1960s as a reaction to the conservative restrictions of the Nashville sound. The critical success of his album Shotgun Willie (1973), combined with the critical and commercial success of Red Headed Stranger (1975) and Stardust (1978), made Nelson one of the most recognized artists in country music. Nelson has acted in over 30 films, co-authored several books, and has been involved in activism for the use of biofuels and the legalization of marijuana.\nNelson wrote his first song at age seven and joined his first band at ten. During high school, he toured locally with the Bohemian Polka as their lead singer and guitar player. After graduating from high school in 1950, he joined the U.S. Air Force but was later discharged due to back problems. After his return, Nelson attended Baylor University for two years but dropped out because he was succeeding in music. He worked as a disc jockey at radio stations in his native Texas, and at several radio stations in the Pacific Northwest, all the while working as a singer and songwriter throughout the late 1950s. During that time, he wrote songs that would become country standards, including \"Funny How Time Slips Away\", \"Hello Walls\", \"Pretty Paper\", and \"Crazy\". In 1960 he moved to Nashville, Tennessee, and later signed a publishing contract with Pamper Music which allowed him to join Ray Price's band as a bassist. In 1962, he recorded his first album, . Due to this success, Nelson signed in 1964 with RCA Victor and joined the Grand Ole Opry the following year. After mid-chart hits in the late 1960s and the early 1970s, Nelson grew weary of the corporate Nashville music scene, and in 1972 he moved to Austin, Texas. The ongoing music scene of Austin motivated Nelson to return to performing, appearing frequently at the Armadillo World Headquarters."]}
{"id": "Billy-Squier/The-Big-Beat", "title": "The Big Beat", "artist": ["Billy Squier"], "release_date": "2005", "genres": ["aor", "pop rock", "rock", "hard rock"], "wikipedia_summary": ["William Haislip Squier (, born May 12, 1950) is an American musician, singer, and songwriter who had a string of arena rock and crossover hits in the early 1980s. His best-known songs include \"The Stroke\", \"Lonely Is the Night\", \"My Kinda Lover\", \"In the Dark\", \"Rock Me Tonite\", \"Everybody Wants You\", \"Emotions in Motion\", \"Love Is the Hero\", and \"Don't Say You Love Me\". Squier's best-selling album, 1981's Don't Say No, is considered a landmark release of arena rock, bridging the gap between power pop and hard rock.\nDescribed as a personification of early 1980s rock music, Squier's most successful period was from 1981 to 1984, during which he had five Top 10 Mainstream Rock hits (two of which were number ones), two Top 20 singles, three consecutive platinum-selling albums, and videos in MTV rotation. Even after falling out from mainstream favor and chart success, which some say is because of the 1984 video for \"Rock Me Tonite\", Squier has maintained his presence on rock radio and his music used in many films and video games. Squier largely stopped recording music after the commercial failure of the 1993 album , but has continued to perform smaller tours, one-off concerts, and occasional collaborations."]}
{"id": "Trouble-Funk/Let%27s-Get-Small", "title": "Let’s Get Small", "artist": ["Trouble Funk"], "release_date": "2004-04-13", "genres": ["funk", "go-go", "r&b", "rap"], "wikipedia_summary": ["Trouble Funk is an American R&B and funk band from Washington, D.C. The group helped to popularize funk and the subgenre go-go in the Washington metropolitan area. Among the band's well-known songs is the go-go anthem \"Hey, Fellas\". They released several studio albums including Drop the Bomb, In Times of Trouble, Live, and Trouble Over Here Trouble Over There (UK No. 54), and two live albums, Trouble Funk: Straight Up Go-Go Style and Saturday Night Live. In 1982, they released a single \"So Early in the Morning\" on D.E.T.T Records, later reissued on diverse labels as 2.13.61 and Tuff City. Trouble Funk sometimes shared the stage with hardcore punk bands of the day such as Minor Threat and the Big Boys."]}
{"id": "Trouble-Funk/Drop-the-Bomb", "title": "Drop the Bomb", "artist": ["Trouble Funk"], "release_date": "2003", "genres": ["funk", "hip hop", "pop rap", "soul", "electro", "gangsta rap", "go-go", "electronic"], "wikipedia_summary": ["Trouble Funk is an American R&B and funk band from Washington, D.C. The group helped to popularize funk and the subgenre go-go in the Washington metropolitan area. Among the band's well-known songs is the go-go anthem \"Hey, Fellas\". They released several studio albums including Drop the Bomb, In Times of Trouble, Live, and Trouble Over Here Trouble Over There (UK No. 54), and two live albums, Trouble Funk: Straight Up Go-Go Style and Saturday Night Live. In 1982, they released a single \"So Early in the Morning\" on D.E.T.T Records, later reissued on diverse labels as 2.13.61 and Tuff City. Trouble Funk sometimes shared the stage with hardcore punk bands of the day such as Minor Threat and the Big Boys."]}
{"id": "Richard-%26-Willie/Brothers", "title": "Brothers", "artist": "Richard & Willie", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Wilhelm Richard Wagner ( VAHG-nər; German: [ˈʁɪçaʁt ˈvaːɡnɐ] ; 22 May 1813 – 13 February 1883) was a German composer, theatre director, essayist, and conductor who is chiefly known for his operas (or, as some of his mature works were later known, \"music dramas\"). Unlike most opera composers, Wagner wrote both the libretto and the music for each of his stage works. Initially establishing his reputation as a composer of works in the romantic vein of Carl Maria von Weber and Giacomo Meyerbeer, Wagner revolutionised opera through his concept of the Gesamtkunstwerk (\"total work of art\"), whereby he sought to synthesise the poetic, visual, musical and dramatic arts, with music subsidiary to drama. The drama was to be presented as a continuously sung narrative, without conventional operatic structures like arias and recitatives. He described this vision in a series of essays published between 1849 and 1852. Wagner realised these ideas most fully in the first half of the 16-hour, four-opera cycle Der Ring des Nibelungen ( also known simply as )."]}
{"id": "Hashim/Al-Naafiysh-(The-Soul)-(B-Side)", "title": "Al-Naafiysh (The Soul) (B-Side)", "artist": "Hashim", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Gerald C. Calliste Jr. (born November 26, 1965), also known as Hashim, is an American entrepreneur, producer, songwriter, publisher, and former DJ who is best known for the hip hop, electro, and dance music song \"Al-Naafiysh (The Soul)\" (1983).[1]"]}
{"id": "The-Notorious-B.I.G./Warning", "title": "Warning", "artist": ["The Notorious B.I.G."], "release_date": "2016-08-12", "genres": ["death by murder", "boom bap", "east coast hip hop", "gangsta rap"], "wikipedia_summary": ["Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names the Notorious B.I.G., Biggie Smalls, and Biggie, was an American rapper. Rooted in the New York rap scene and gangsta rap traditions, he is widely considered one of the greatest rappers of all time. Wallace became known for his distinctive, laidback lyrical delivery, offsetting his lyrics' often grim content. His music was usually semi-autobiographical, telling of hardship and criminality but also of debauchery and celebration.\nBorn and raised in Brooklyn, New York City, Wallace was the first artist to sign with Sean \"Puffy\" Combs's Bad Boy Records in 1993. That same year, he gained recognition for his guest appearances on other artists' singles. His debut studio album, Ready to Die (1994), received widespread critical acclaim and included signature tracks \"Juicy\" and \"Big Poppa\". This album made him the central figure in East Coast hip hop, helping to restore New York's prominence at a time when the West Coast was dominating the genre. In 1995, Wallace was named Rapper of the Year at the Music Awards. That same year, Wallace and his protégé group, Junior M.A.F.I.A.—which included longtime friends like Lil' Kim—released their debut album, (1995)."]}
