{"id": "Future/Like-That", "title": "Like That", "artist": ["Future", "Metro Boomin", "Kendrick Lamar"], "release_date": "2024-03-22", "genres": ["hip hop"], "wikipedia_summary": ["Nayvadius DeMun Cash (né Wilburn; born November 20, 1983), known professionally as Future, is an American rapper, singer-songwriter, and record producer. Known for his mumble-styled vocals and prolific output, Future is credited with having pioneered the use of Auto-Tuned melodies in hip-hop and trap music. Due to the sustained popularity of this musical style, he is commonly regarded as one of the most influential rappers of his generation.\nBorn and raised in Atlanta, Georgia, Future signed a recording contract with Rocko's A1 Recordings in 2011, which entered a joint venture with Epic Records shortly after. His first two studio albums, Pluto (2012) and Honest (2014), were both met with critical and commercial success, spawning the platinum-certified singles \"Turn On the Lights\", \"Honest\", \"Move That Dope\" (featuring Pharrell Williams and Pusha T), and \"I Won\" (featuring Kanye West). His subsequent albums have each debuted atop the US 200; his third and fourth, (2015) and (2016), were supported by the singles \"Where Ya At\" (featuring Drake) and \"Low Life\" (featuring the Weeknd), respectively. Future's eponymous fifth album and its follow-up, (both 2017) made him the first musical act to release two chart-topping projects on the 200 in consecutive weeks—the former spawned his first Hot 100-top ten single, \"Mask Off.\"", "Leland Tyler Wayne (born September 16, 1993), known professionally as Metro Boomin, is an American record producer and music executive. Widely acclaimed for his dark and cinematic production style, he is regarded as one of the most influential producers in modern hip-hop and trap music. He has produced notable hits for artists such as Future, Post Malone, 21 Savage, Offset, Migos, Kanye West, The Weeknd, Gunna, Gucci Mane, Young Thug, Kodak Black, Drake, and Kendrick Lamar.\nRaised in St. Louis, Missouri, Wayne began his career in music production in 2009 at the age of 16. He relocated to Atlanta to attend Morehouse College in 2011, during which he worked extensively with Atlanta-based artists including Future, Young Thug, 21 Savage, Gucci Mane, and Migos. Wayne gained wider recognition for co-producing the 2014 single \"Tuesday\" for iLoveMakonnen, which peaked at number 12 on the Hot 100. He was credited on a string of similarly successful singles throughout 2016, including \"Jumpman\" by Drake and Future, \"Father Stretch My Hands\" by Kanye West, \"Low Life\" by Future, and his first number-one production, \"Bad and Boujee\" by Migos. This was followed by the diamond-certified (14x platinum) \"Congratulations\" by Post Malone, \"Tunnel Vision\" by Kodak Black, \"Mask Off\" by Future, \"Bank Account\" by 21 Savage, and his second number-one production, \"Heartless\" by the Weeknd.", "Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "Kendrick-Lamar/Not-Like-Us", "title": "Not Like Us", "artist": ["Kendrick Lamar"], "release_date": "2025-02-06", "genres": ["alternative hip hop", "conscious hip hop", "hip hop", "hardcore hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "Kendrick-Lamar/Tv-Off", "title": "tv off", "artist": ["Kendrick Lamar", "Lefty Gunplay"], "release_date": "2024-11-27", "genres": ["alternative hip hop", "conscious hip hop", "hip hop", "hardcore hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart.", "Franklin Scott Holladay, better known by his stage name Lefty Gunplay, is an American rapper from Los Angeles. Born and raised in Baldwin Park, Holladay is signed to JasonMartin's label Diamond Lane Music Group, as well as OTR Records as of 2024 and has released four albums, including Rookie of the Year and Most Valuable Gangbanger. He gained recognition for his feature on Kendrick Lamar's GNX single \"TV Off\"."]}
{"id": "Kendrick-Lamar/Reincarnated", "title": "reincarnated", "artist": ["Kendrick Lamar"], "release_date": "2024-11-27", "genres": ["alternative hip hop", "conscious hip hop", "hip hop", "hardcore hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "Kendrick-Lamar/Squabble-Up", "title": "squabble up", "artist": ["Kendrick Lamar"], "release_date": "2024-11-22", "genres": ["alternative hip hop", "conscious hip hop", "hip hop", "hardcore hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "21-Savage/Redrum", "title": "redrum", "artist": ["21 Savage"], "release_date": "2024-01-12", "genres": ["gangsta rap", "mumble rap", "hip hop", "pop rap"], "wikipedia_summary": ["Shéyaa Bin Abraham-Joseph (born October 22, 1992), known professionally as 21 Savage, is an American and British rapper. Born in London and raised in Atlanta, he began his recording career in 2013 and released three independent mixtapes to regional acclaim. His breakout project—the collaborative extended play (EP) with record producer Metro Boomin titled Savage Mode (2016)—peaked at number 23 on the Billboard 200. Its lead singles, \"X\" (featuring Future) and \"No Heart\" both peaked within the top 40 of the Billboard Hot 100. Later that year, he saw further recognition for his guest appearance on Drake's single \"Sneakin'\". He then signed a recording contract with Epic Records in January 2017.\n21 Savage's debut studio album, Issa Album (2017), peaked at number two on the Billboard 200, while its lead single, \"Bank Account\" peaked at number 12 on the Hot 100. That same year, he released the collaborative album (2017) with Metro Boomin and fellow Georgia-based rapper Offset, and guest appeared on Post Malone's 2017 single \"Rockstar\", which peaked atop the Hot 100 and received two nominations—Record of the Year and Best Rap/Sung Performance—at the 61st Annual Grammy Awards. His second album, (2018), became his first to debut atop the 200 and spawned the single \"A Lot\" (featuring J. Cole), which won Best Rap Song at the 62nd Annual Grammy Awards. The following year, he and Metro Boomin released a sequel to their breakout EP with (2020), which also debuted atop the 200 and spawned the top ten-singles \"Runnin\" and \"Mr. Right Now\" (featuring Drake). He guest appeared on Drake's 2022 single \"Jimmy Cooks\", which marked his first song to debut atop the Hot 100 and second to do so overall. Later that year, he and Drake released the collaborative album (2022), which saw continued success as his third project to peak the 200. His third album, (2024), became his fourth consecutive chart-topping project, and spawned the Hot 100 top-ten songs \"Redrum\" and \"Née-Nah\"."]}
{"id": "Tyler,-the-Creator/Balloon", "title": "Balloon", "artist": ["Tyler, The Creator", "Doechii"], "release_date": "2025-01-15", "genres": ["hip hop", "horrorcore", "_fix whosampled dupe url", "hardcore hip hop"], "wikipedia_summary": ["Tyler Gregory Okonma (born March 6, 1991), known professionally as Tyler, the Creator, is an American rapper, singer, songwriter, and record producer. He has been cited as an influential figure in alternative hip-hop during the 2010s. Okonma became well known in the late 2000s, when he emerged on the internet as the leader and co-founder of the music collective Odd Future. Within the group, Okonma participated as a rapper, producer, director and actor, releasing studio albums that he produced for its respective members. Okonma also performed on the group's sketch comedy show Loiter Squad (2012–2014).\nAlong with his collaborations with the group, Okonma developed his solo career beginning with his self-released debut studio album, Bastard (2009). earned him recognition in the online music press as an emerging artist from the indie music scene. His second studio album, (2011), brought him mainstream media exposure, aided by the popularity of the single \"Yonkers\" and its accompanying music video. During this period, Okonma faced controversy in the media for his horrorcore-influenced sound and his violent, transgressive lyrical content.", "Jaylah Ji'mya Hickmon (born August 14, 1998), known professionally as Doechii (), is an American rapper, singer, and songwriter. She first gained attention on TikTok, leading her to sign with Top Dawg Entertainment and Capitol Records in 2022. Her 2023 single \"What It Is (Block Boy)\", which features Kodak Black, became her first entry on the Billboard Hot 100 and received a platinum certification by the Recording Industry Association of America (RIAA).\nDoechii's third mixtape, Alligator Bites Never Heal (2024), peaked at number 12 on the Billboard 200 and was met with critical acclaim. It won Best Rap Album at the 67th Annual Grammy Awards, making her the third female artist to win in the category. It spawned the singles \"Nissan Altima\" and \"Denial Is a River\". Her 2025 single \"Anxiety\" became her highest charting entry on the Hot 100."]}
{"id": "Kendrick-Lamar/Meet-the-Grahams", "title": "meet the grahams", "artist": ["Kendrick Lamar"], "release_date": "2024-05-03", "genres": ["hip hop"], "wikipedia_summary": ["Kendrick Lamar Duckworth (born June 17, 1987) is an American rapper. Regarded as one of the greatest rappers of all time, he was awarded the 2018 Pulitzer Prize for Music, becoming the first musician outside of the classical and jazz genres to receive the honor.\nBorn in Compton, California, Lamar began releasing music under the stage name K.Dot while attending high school. He signed with Top Dawg Entertainment (TDE) in 2005, and co-founded the hip hop supergroup Black Hippy there. Following the 2011 release of his alternative rap debut album Section.80, Lamar secured a joint contract with Dr. Dre's Aftermath Entertainment and Interscope Records. He rose to prominence with his gangsta rap-influenced second album Good Kid, M.A.A.D City (2012), which became the longest-charting hip hop studio album in Billboard 200 history; named it the greatest concept album of all time. In 2015, Lamar scored his first Hot 100 number-one single, after featuring on the remix of Taylor Swift's \"Bad Blood\", and released his third album, , which infused hip-hop with historical African-American music genres such as jazz, funk, and soul, and became his first of six consecutive number-one albums on the Billboard 200 chart."]}
{"id": "JPEGMAFIA/Either-on-or-Off-the-Drugs", "title": "either on or off the drugs", "artist": ["JPEGMAFIA"], "release_date": "2024-08-01", "genres": ["drumless hip hop"], "wikipedia_summary": ["Barrington DeVaughn Hendricks (born October 22, 1989), known professionally as JPEGMafia (stylized in all caps as JPEGMAFIA), is an American rapper, singer, and record producer. Born in Flatbush, Brooklyn, he signed with Deathbomb Arc to release his debut studio album, Black Ben Carson (2016) and his second album Veteran (2018), which received widespread critical acclaim. His third album, All My Heroes Are Cornballs (2019) was released through EQT Recordings and entered the Billboard 200, and had signed to Republic for the release of his fourth album LP! (2021); both were met with continued critical acclaim. In 2023, he released his collaborative studio album Scaring the Hoes with fellow alternative rapper Danny Brown through AWAL. In 2024, he released his fifth studio album I Lay Down My Life for You."]}
{"id": "%C2%A5$/CARNIVAL", "title": "CARNIVAL", "artist": ["¥$", "Rich the Kid", "Playboi Carti"], "release_date": "2024-02-15", "genres": ["english", "plugg", "hip house", "trap", "hip hop", "cloud rap", "r&b", "southern hip hop", "alternative r&b", "conscious hip hop", "electropop", "chipmunk soul", "christian hip hop"], "wikipedia_summary": ["¥$ is an American hip hop superduo composed of rapper Kanye West and singer Ty Dolla Sign. With the two maintaining a strong relationship during 2023, West invited Ty Dolla Sign to record songs in Tokyo, Italy, and later Saudi Arabia. During the recording sessions for West's eleventh studio album, the duo began work on their collaborative effort, Vultures 1 (2024), which received mixed reviews from critics and was a commercial success that topped the US Billboard 200.\nVultures 1 spawned the single \"Carnival\" (with Rich the Kid featuring Playboi Carti), which peaked atop the US Billboard Hot 100. After several delays, the duo's second album, Vultures 2 (2024), was released in August of that year. It was met with weaker sales—peaking at number two on the 200—and negative reception from critics, who felt the album was exceedingly unfinished. They won Best Group at the BET Awards 2024.", "Ye ( YAY), born Kanye Omari West ( KAHN-yay; June 8, 1977), is an American rapper and record producer. One of the most prominent figures in hip-hop, he is known for his varying musical style and polarizing cultural and political commentary. After dropping out of college to pursue a career in music, West began producing for regional artists in the Chicago area. As an in-house producer for Roc-A-Fella Records, he co-produced albums including Jay-Z's The Blueprint (2001) before signing with the label as a recording artist. West's debut studio album, The College Dropout (2004), was met with critical acclaim and yielded the Billboard Hot 100-number one single \"Slow Jamz\". He peaked the chart on four other occasions with the singles \"Gold Digger\" (2005), \"Stronger\" (2007), \"E.T.\" (2011, as a featured artist), and \"Carnival\" (2024).", "Tyrone William Griffin Jr. (born April 13, 1982), known professionally as Ty Dolla Sign (stylized as Ty Dolla $ign or Ty$), is an American singer, songwriter, record producer and rapper. Born and raised in Los Angeles, California, Griffin gained initial recognition for his guest appearance on fellow Los Angeles rapper YG's 2010 single \"Toot It and Boot It\", which entered the Billboard Hot 100. He signed with Atlantic Records in 2012, and Wiz Khalifa's Taylor Gang Entertainment the following year.\nGriffin saw further mainstream recognition for his debut commercial extended play (EP), Beach House EP (2014). Its release was preceded by his 2013 single \"Paranoid\" (featuring B.o.B), which marked his first entry—at number 29—on the Billboard Hot 100 as a lead artist. Its 2014 follow-up, \"Or Nah\" (featuring Wiz Khalifa and DJ Mustard, remixed with the Weeknd) was met with continued success and received sextuple platinum certification from the Recording Industry Association of America (RIAA). His debut studio album, (2015), peaked at number 14 on the 200 and was supported by the platinum-certified singles \"Blasé\" (featuring Future and Rae Sremmurd) and \"Saved\" (featuring E-40). His second album, (2017) peaked at number 11 on the 200, while his third album, (2020) peaked at number four. He has released the collaborative albums (2018) with Jeremih, (2021) with Dvsn, and and (2024) with Kanye West— became his first to debut atop the 200.", "Jordan Terrell Carter (born September 13, 1995 or 1996), known professionally as Playboi Carti, is an American rapper. He first signed with local underground record label Awful Records in 2014, and later signed with ASAP Mob's record label AWGE, in a joint venture with Interscope Records two years later. Carter gained mainstream attention following the release of his eponymous debut mixtape (2017), which peaked at number 12 on the U.S. Billboard 200 and spawned the Billboard Hot 100-charting singles \"Magnolia\" and \"Wokeuplikethis\" (featuring Lil Uzi Vert).\nCarter's debut studio album Die Lit (2018) saw further commercial success, peaking at number three on the Billboard 200. Following a two-year hiatus, his second studio album, Whole Lotta Red (2020) debuted atop the chart and was met with positive reviews; it was listed as among the best albums of that year by and , with ranking it on their list of the \"200 Greatest Hip-Hop Albums of All Time\". He guest performed on ¥$'s 2024 single, \"Carnival\", which became his first song to peak atop the Hot 100. Carter's third studio album, (2025), was given similarly positive reviews and became his second consecutive number-one album on the 200.", "Dimitri Leslie Roger (born July 13, 1992), known professionally as Rich the Kid, is an American rapper. After a number of independent mixtapes, he signed with Interscope Records in 2017 to release his debut studio album, The World Is Yours (2018). Supported by the singles \"New Freezer\" (featuring Kendrick Lamar) and \"Plug Walk\", the album peaked at number two on the Billboard 200. His second and third studio albums, The World Is Yours 2 (2019) and Boss Man (2020) peaked at numbers four and 24 on the chart, respectively. He has also released the collaborative mixtapes Nobody Safe (2020) with YoungBoy Never Broke Again, and Trust Fund Babies (2021) with Lil Wayne. Furthermore, he founded the record label Rich Forever Music in 2016, through which he has signed rappers Famous Dex and Jay Critch."]}
{"id": "Eazy-E/Eazy-Duz-It", "title": "Eazy-Duz-It", "artist": ["Eazy‐E"], "release_date": "2002-08-27", "genres": ["g-funk", "hip hop", "west coast rap", "rap", "dirty rap", "gangsta rap", "hardcore rap"], "wikipedia_summary": ["Eric Lynn Wright (September 7, 1964 – March 26, 1995), known professionally by his stage name Eazy-E, was an American rapper who propelled West Coast rap and gangsta rap by leading the group N.W.A and its label, Ruthless Records. He is often referred to as the \"Godfather of Gangsta Rap\".\nBorn and raised in Compton, California, Wright had several legal troubles before founding Ruthless in 1987. After a short solo career with frequent collaboration with Ice Cube and Dr. Dre, they joined, forming N.W.A, later that year. N.W.A's debut studio album, Straight Outta Compton, was released in 1989. Controversial upon release, it is now ranked among the greatest and most influential albums ever. The group released its second and final studio album, , in 1991, and soon after disbanded."]}
{"id": "Rodney-O-and-Joe-Cooley/Everlasting-Bass", "title": "Everlasting Bass", "artist": ["Rodney O & Joe Cooley"], "release_date": "2006", "genres": ["hip hop"], "wikipedia_summary": ["Rodney-O & Joe Cooley, consisting of rapper Rodney Oliver, also known as \"Rodney O\", DJ Joe Cooley (August 15 1965) and Jeffrey Page, also known as \"General Jeff\", is an American rap group from Southern California. Rodney O, from Riverside, and Joe Cooley, from Compton, and General Jeff, from Los Angeles. Best known for tracks such as \"Everlasting Bass,\" \"Cooley High,\" and \"This is for the Homies.\" At the height of their popularity, the group toured with MC Lyte, N.W.A, Kool Moe Dee and Grandmaster Flash. The group would gain more popularity in South Florida than their native Southern California, giving them a pioneering role in Miami bass.\nIn 2015, Rolling Stone named “Everlasting Bass” as one of the 20 greatest West Coast Rap Songs released prior to N.W.A's 1989 album Straight Outta Compton. After over a decade of silence, the group announced that they were planning a new album in 2011. The album was tentatively titled , but only the single \"That Supa Radio\" materialized."]}
{"id": "Birdman/Pop-Bottles", "title": "Pop Bottles", "artist": ["Lil Wayne", "Birdman"], "release_date": "2011-03", "genres": ["2000s", "hip hop", "criminal", "2010s", "rap", "gangsta rap"], "wikipedia_summary": ["Bryan Christopher Williams (né Brooks; February 15, 1969), better known by his stage names Birdman or Baby, is an American rapper and record executive. He is the public face of Cash Money Records, a record label he co-founded with his older brother, Ronald \"Slim\" Williams, in 1991. Birdman released his eponymous debut studio album in 2002, and released three follow-up albums—Fast Money (2005), 5 * Stunna (2007), and Priceless (2009)—to moderate commercial success and mixed critical reception. Along with his solo career, he is a member of the hip hop duo Big Tymers with producer Mannie Fresh, as well as the supergroup Cash Money Millionaires.\nApart from his solo work and five releases as part of Big Tymers, Birdman is best known for his discovery and mentorship of fellow New Orleans rapper Lil Wayne, with whom he released the collaborative album, (2006). As label-head of Cash Money Records, he has been central to the career and commercial success of Wayne, as well as future signees including Drake, Nicki Minaj, and Tyga. Many acts were signed in a joint venture with Wayne's Young Money Entertainment (branded as \"YMCMB\"), a label that ran as an imprint of Cash Money from its formation in 2005 until 2018. Birdman also founded the spin-off project Rich Gang in 2014, a loose-knit collective assembled from core signees of both labels; it was joined and soon led by then-upcoming Southern rappers Young Thug and Rich Homie Quan, as well as other artists not directly signed to the labels.", "Dwayne Michael Carter Jr. (born September 27, 1982), known professionally as Lil Wayne, is an American rapper. He is often regarded as one of the most influential hip hop artists of his generation, as well as one of the greatest rappers of all time. Born and raised in New Orleans, he was discovered by hometown rapper Birdman in 1993 and signed with his record label, Cash Money Records, at age eleven. He emerged as the label's flagship artist until his departure in June 2018.\nHe was first placed in a duo with Cash Money labelmate B.G. (then known as Lil Doogie) in 1994—known collectively as the B.G.'z—and they released an album, True Story, in July of that year, although Carter (at the time known as Baby D) appeared on only three its tracks. Carter and B.G. then formed the Southern hip-hop group Hot Boys with labelmates Juvenile and Turk in 1997; they released their debut album, in October of that year. The Hot Boys gained mainstream success following the release of their second album (1999), and their appearance on B.G.'s single, \"Bling Bling\". The group briefly disbanded after the album due to each member (besides Carter) parting ways with the label, although one further album— (2003)—was released."]}
{"id": "Monk-Higgins/I-Believe-to-My-Soul", "title": "I Believe To My Soul", "artist": ["Monk Higgins"], "release_date": "1968", "genres": ["jazz", "2008 universal fire victim"], "wikipedia_summary": ["Milton Bland (October 3, 1936 – July 3, 1986), better known as Monk Higgins, was an American composer, producer, arranger, tenor saxophonist, keyboardist, and music executive born in Menifee, Arkansas."]}
{"id": "The-Sixth-Sense/I-See-Dead-People", "title": "I See Dead People", "artist": "The Sixth Sense", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "YG/I%27m-Good", "title": "I’m Good", "artist": ["YG"], "release_date": "2011-05-02", "genres": ["hip hop", "ratchet music", "west coast hip hop", "drake"], "wikipedia_summary": ["Keenon Dequan Ray Jackson (born March 9, 1990), better known by his stage name YG (short for Young Gangsta), is an American rapper. He released his debut mixtape 4Fingaz in 2008, and its follow-up, The Real 4Fingaz, the following year. The latter gained recognition for its local hit song \"Toot It and Boot It\", which entered the Billboard Hot 100 at number 67 and received platinum certification by the Recording Industry Association of America (RIAA). He signed a recording contract with Def Jam Recordings in October 2009, which entered joint-venture with Atlanta-based rapper Jeezy's record label, CTE World, in 2013.\nHis 2013 single, \"My Nigga\" (featuring Jeezy and Rich Homie Quan), peaked at number 19 on the Billboard Hot 100. The song and its follow-ups, \"Left, Right\" (featuring DJ Mustard) and \"Who Do You Love?\" (featuring Drake), preceded the release of his debut studio album, (2014), which peaked at number two on the 200 and saw positive critical reception. Also in 2014, he guest appeared on Jeremih's single \"Don't Tell 'Em\", which peaked at number six on the Hot 100 and remains his highest-charting song. His second album, (2016), was met with critical acclaim despite less commercial orientation, as it explored political and social issues for its subject matter."]}
{"id": "2Pac/Made-Niggas", "title": "Made Niggas", "artist": ["2Pac", "Outlawz"], "release_date": "1996", "genres": ["death by murder", "g-funk", "hip hop", "90s", "gangsta rap", "conscious hip hop"], "wikipedia_summary": ["Tupac Amaru Shakur ( ; born Lesane Parish Crooks; June 16, 1971 – September 13, 1996), also known by his stage names 2Pac and Makaveli, was an American rapper and actor. He is regarded as one of the greatest and most influential rappers of all time. Academics regard him as one of the most influential music artists of the 20th century and a prominent political activist for Black America. In addition to his music career, Shakur also wrote poetry and starred in films. He is among the best-selling music artists, having sold more than 75 million records worldwide. His lyrical content has been noted for addressing social injustice, political issues, and the marginalization of other African-Americans, but he was also synonymous with gangsta rap and violent lyrics.", "Outlawz was an American hip-hop group founded by Tupac Shakur and Yafeu Fula in 1995. Originally known as Thoro Headz and Young Thugs, the group attracted attention with their appearance on Tupac's song \"Flex\", which was the B-side of his single \"Holler If Ya Hear Me\", released on February 4, 1993.\nThe group formed as Dramacydal and appeared on the tracks \"Me Against the World\" and \"Outlaw\" from Shakur's album Me Against the World, released on March 14, 1995."]}
{"id": "Debbie-Deb/When-I-Hear-Music", "title": "When I Hear Music", "artist": ["Debbie Deb"], "release_date": "2008-02-11", "genres": ["breaks", "dance", "hip hop", "rap and hip-hop", "electro", "freestyle", "electronic"], "wikipedia_summary": ["Deborah Claire Wesoff-Kowalski (born March 10, 1966), known professionally as Debbie Deb, is an American singer and songwriter best known for her 1980s freestyle dance singles \"Lookout Weekend\" and \"When I Hear Music\"."]}
{"id": "21-Savage/A-Lot", "title": "a lot", "artist": ["21 Savage"], "release_date": "N/A", "genres": ["gangsta rap", "mumble rap", "hip hop", "pop rap"], "wikipedia_summary": ["Shéyaa Bin Abraham-Joseph (born October 22, 1992), known professionally as 21 Savage, is an American and British rapper. Born in London and raised in Atlanta, he began his recording career in 2013 and released three independent mixtapes to regional acclaim. His breakout project—the collaborative extended play (EP) with record producer Metro Boomin titled Savage Mode (2016)—peaked at number 23 on the Billboard 200. Its lead singles, \"X\" (featuring Future) and \"No Heart\" both peaked within the top 40 of the Billboard Hot 100. Later that year, he saw further recognition for his guest appearance on Drake's single \"Sneakin'\". He then signed a recording contract with Epic Records in January 2017.\n21 Savage's debut studio album, Issa Album (2017), peaked at number two on the Billboard 200, while its lead single, \"Bank Account\" peaked at number 12 on the Hot 100. That same year, he released the collaborative album (2017) with Metro Boomin and fellow Georgia-based rapper Offset, and guest appeared on Post Malone's 2017 single \"Rockstar\", which peaked atop the Hot 100 and received two nominations—Record of the Year and Best Rap/Sung Performance—at the 61st Annual Grammy Awards. His second album, (2018), became his first to debut atop the 200 and spawned the single \"A Lot\" (featuring J. Cole), which won Best Rap Song at the 62nd Annual Grammy Awards. The following year, he and Metro Boomin released a sequel to their breakout EP with (2020), which also debuted atop the 200 and spawned the top ten-singles \"Runnin\" and \"Mr. Right Now\" (featuring Drake). He guest appeared on Drake's 2022 single \"Jimmy Cooks\", which marked his first song to debut atop the Hot 100 and second to do so overall. Later that year, he and Drake released the collaborative album (2022), which saw continued success as his third project to peak the 200. His third album, (2024), became his fourth consecutive chart-topping project, and spawned the Hot 100 top-ten songs \"Redrum\" and \"Née-Nah\".", "Jermaine Lamarr Cole (born January 28, 1985) is an American rapper and record producer. Born in a military base in Germany and raised in Fayetteville, North Carolina, Cole initially gained attention as a rapper following the release of his debut mixtape, The Come Up, in early 2007. Intent on further pursuing a musical career, he signed with Jay-Z's Roc Nation in 2009 and released two additional mixtapes: The Warm Up (2009) and Friday Night Lights (2010) to further critical acclaim as he garnered a wider following.\nEach of Cole's studio albums have peaked atop the US Billboard 200, beginning with his debut, Cole World: The Sideline Story (2011), and its follow-up, Born Sinner (2013). Both met with critical acclaim, the albums spawned the Billboard Hot 100-top 40 singles \"Work Out\", \"Power Trip\" (featuring Miguel), and \"Crooked Smile\" (featuring TLC). Despite commercial success, Cole departed from the pop-oriented sound of the albums in favor of conscious subject matter for his subsequent projects; themes of nostalgia, racial inequality, and materialism were explored respectively in his following releases: (2014), (2016) and (2018). yielded his furthest commercial success—selling an estimated 500,000 album-equivalent units in its first week, while the latter featured a then-record six simultaneous top 20 hits on the Hot 100—the first time a musical act achieved this feat since English rock band the Beatles in 1964. His sixth album, (2021), was met with continued success and spawned the single \"My Life\" (with 21 Savage and Morray), which peaked at number two on the Hot 100. Its chart success was matched by his guest appearance on the 2023 single \"All My Life\" by Lil Durk, and succeeded by his first song to peak the chart, \"First Person Shooter\" by Drake that same year. The former also won Cole a Grammy Award for Best Melodic Rap Performance."]}
{"id": "Akiko-Yano/%E3%83%A8%E3%83%BB%E3%83%AD%E3%83%BB%E3%82%B3%E3%83%BB%E3%83%93", "title": "ヨ・ロ・コ・ビ", "artist": "Akiko Yano", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Akiko Yano (矢野 顕子, Yano Akiko, born Akiko Suzuki (鈴木 顕子, Suzuki Akiko); February 13, 1955) is a Japanese pop and jazz musician and singer born in Tokyo and raised in Aomori and later began her singing career in the mid-1970s. She has been called \"one of the major musical talents of the Japanese popular music world\", and her vocals and singing style have been compared to English singer Kate Bush (who she predates by several years).\nShe has recorded with Yellow Magic Orchestra and its members Ryuichi Sakamoto, Haruomi Hosono and Yukihiro Takahashi, as well as with Swing Out Sister, Pat Metheny, The Chieftains, Lyle Mays, members of Little Feat, David Sylvian, Mick Karn, Kenji Omura, Gil Goldstein, Toninho Horta, Mino Cinelu, Jeff Bova, Charlie Haden, Peter Erskine, Anthony Jackson, David Rhodes, Bill Frisell, Thomas Dolby, the band Quruli, Rei Harakami as Yanokami and her daughter Miu Sakamoto."]}
{"id": "Monk-Higgins/Mac-Arthur-Park", "title": "Mac Arthur Park", "artist": ["Monk Higgins"], "release_date": "1968", "genres": ["jazz", "2008 universal fire victim"], "wikipedia_summary": ["Milton Bland (October 3, 1936 – July 3, 1986), better known as Monk Higgins, was an American composer, producer, arranger, tenor saxophonist, keyboardist, and music executive born in Menifee, Arkansas."]}
{"id": "Elza-Laranjeira/Serenata-Do-Adeus", "title": "Serenata Do Adeus", "artist": "Elza Laranjeira", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "The-Shining/Here%27s-Johnny!", "title": "Here's Johnny!", "artist": "The Shining", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["N/A"]}
{"id": "Luke/I-Wanna-Rock", "title": "I Wanna Rock", "artist": ["Luke"], "release_date": "1998-03-24", "genres": ["hip hop", "hip-hop", "dirty rap", "american"], "wikipedia_summary": ["Luther Roderick Campbell (born December 22, 1960), also known as Luke Skyywalker, Uncle Luke and simply Luke, is an American rapper, promoter, record executive, actor, and former leader of the rap group 2 Live Crew. He is known for having helped create the Miami bass genre, for establishing one of the first rap groups and rap labels in Southern hip hop, and his sexually crude call and response lyrics which were unique for the time period. He also starred in a short-lived show on VH1, Luke's Parental Advisory."]}
{"id": "John-Barry/The-Black-Hole-Overture", "title": "The Black Hole - Overture", "artist": "John Barry", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["John Barry Prendergast (3 November 1933 – 30 January 2011) was an English composer and conductor of film music. Born in York, Barry spent his early years working in cinemas owned by his father. During his national service with the British Army in Cyprus, Barry began performing as a musician after learning to play the trumpet. Upon completing his national service, he formed a band in 1957, the John Barry Seven. He later developed an interest in composing and arranging music, making his début for television in 1958. He came to the notice of the filmmakers of the first James Bond film Dr. No, who were dissatisfied with a theme for James Bond given to them by Monty Norman. Noel Rogers, the head of music at United Artists, approached Barry. This started a successful association between Barry and the Bond series that lasted for 25 years."]}
{"id": "Andrew-Wartts/Can-You-Say-Yeah%3F", "title": "Can You Say Yeah", "artist": ["Andrew Wartts and The Gospel Storytellers"], "release_date": "1982", "genres": [], "wikipedia_summary": ["N/A", "N/A"]}
{"id": "Timothy-Carpenter/I-Want-to-Make-It", "title": "I Want to Make It", "artist": "Timothy Carpenter, Triunity", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["John Howard Carpenter (born January 16, 1948) is an American filmmaker, composer, and actor. Most commonly associated with horror, action, and science fiction films of the 1970s and 1980s, he is generally recognized as a master of the horror genre. At the 2019 Cannes Film Festival, the French Directors' Guild gave him the Golden Coach Award and lauded him as \"a creative genius of raw, fantastic, and spectacular emotions\". On April 3, 2025, he received a star on the Hollywood Walk of Fame.\nCarpenter's early films included critical and commercial successes such as Halloween (1978), The Fog (1980), Escape from New York (1981), and Starman (1984). Though he has been acknowledged as an influential filmmaker, his other productions from the 1970s and the 1980s only later came to be considered cult classics; these include (1974), (1976), (1982), (1983), (1986), (1987), (1988), (1994), and (1996). He returned to the franchise as a composer and executive producer on (2018), (2021), and (2022).", "N/A"]}
{"id": "AI-for-the-Culture/Turn-on-the-Lights", "title": "Turn on the Lights", "artist": "AI for the Culture", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Ai Carina Uemura (植村 愛 カリーナ, Uemura Ai Karīna, born November 2, 1981), known mononymously as Ai (Japanese pronunciation: [ai], stylized as AI or A.I. ), is a Japanese-American singer, songwriter and rapper. Born in Los Angeles, Ai moved to Kagoshima at age four. Motivated to become a singer, she returned to Los Angeles during her adolescence, attending the Los Angeles County High School for the Arts. While in Los Angeles, she performed as part of a gospel choir at a Mary J. Blige concert and appeared as a backup dancer in Janet Jackson's music video, \"Go Deep\". She briefly joined the Asian girl group SX4 in 1999 until she graduated high school."]}
{"id": "The-Notorious-B.I.G./Kick-in-the-Door", "title": "Kick in the Door", "artist": ["The Notorious B.I.G."], "release_date": "1996", "genres": ["stage & screen", "hip hop", "east coast rap", "east coast hip hop", "rap", "soundtracks", "gangsta rap", "hardcore rap"], "wikipedia_summary": ["Christopher George Latore Wallace (May 21, 1972 – March 9, 1997), better known by his stage names the Notorious B.I.G., Biggie Smalls, and Biggie, was an American rapper. Rooted in the New York rap scene and gangsta rap traditions, he is widely considered one of the greatest rappers of all time. Wallace became known for his distinctive, laidback lyrical delivery, offsetting his lyrics' often grim content. His music was usually semi-autobiographical, telling of hardship and criminality but also of debauchery and celebration.\nBorn and raised in Brooklyn, New York City, Wallace was the first artist to sign with Sean \"Puffy\" Combs's Bad Boy Records in 1993. That same year, he gained recognition for his guest appearances on other artists' singles. His debut studio album, Ready to Die (1994), received widespread critical acclaim and included signature tracks \"Juicy\" and \"Big Poppa\". This album made him the central figure in East Coast hip hop, helping to restore New York's prominence at a time when the West Coast was dominating the genre. In 1995, Wallace was named Rapper of the Year at the Music Awards. That same year, Wallace and his protégé group, Junior M.A.F.I.A.—which included longtime friends like Lil' Kim—released their debut album, (1995)."]}
{"id": "ExpertVillage-Leaf-Group/Importing-the-JPEG-for-Digital-Embroidery-Machine-Designs", "title": "Importing the JPEG for Digital Embroidery Machine Designs", "artist": "ExpertVillage Leaf Group", "release_date": "N/A", "genres": "N/A", "wikipedia_summary": ["Carbon Leaf is a quintet from Richmond, Virginia, known for their alt-country, Celtic, and folk-infused indie rock. Though some of the band members have changed through the years, Carbon Leaf has been consistently creating and performing music since the early 1990s. The band currently consists of founding members Barry Privett, Carter Gravatt, and Terry Clark, as well as Jon Markel and Jesse Humphrey. Carbon Leaf is best known for the song \"Life Less Ordinary\", which debuted in 2004 and reached #5 on Billboard's Adult Alternative charts."]}
{"id": "Kanye-West/Hell-of-a-Life", "title": "Hell of a Life", "artist": ["Kanye West"], "release_date": "2010-11-22", "genres": ["rap"], "wikipedia_summary": ["Ye ( YAY), born Kanye Omari West ( KAHN-yay; June 8, 1977), is an American rapper and record producer. One of the most prominent figures in hip-hop, he is known for his varying musical style and polarizing cultural and political commentary. After dropping out of college to pursue a career in music, West began producing for regional artists in the Chicago area. As an in-house producer for Roc-A-Fella Records, he co-produced albums including Jay-Z's The Blueprint (2001) before signing with the label as a recording artist. West's debut studio album, The College Dropout (2004), was met with critical acclaim and yielded the Billboard Hot 100-number one single \"Slow Jamz\". He peaked the chart on four other occasions with the singles \"Gold Digger\" (2005), \"Stronger\" (2007), \"E.T.\" (2011, as a featured artist), and \"Carnival\" (2024)."]}
{"id": "Jadakiss/Put-Ya-Hands-Up", "title": "Put Ya Hands Up", "artist": ["Jadakiss"], "release_date": "2001-07", "genres": ["hip hop", "east coast hip hop"], "wikipedia_summary": ["Jason Terrance Phillips (born May 27, 1975), better known by his stage name Jadakiss (, JAY-duh-kiss), is an American rapper who began his career in the 1990s and formed the hip hop trio the Lox alongside Styles P and Sheek Louch in 1994. The group signed with Puff Daddy's Bad Boy Records, an imprint of Arista Records to release their debut studio album, Money, Power & Respect (1998); their second album, We Are the Streets (2000) was released by Ruff Ryders Entertainment, an imprint of Interscope Records. Both peaked within the top five of the Billboard 200 and yielded critical praise; their two subsequent albums, Filthy America... It's Beautiful (2016) and Living Off Xperience (2020) were both released by Jay-Z's Roc Nation and met with continued praise."]}
{"id": "Playboi-Carti/BACKR00MS", "title": "BACKR00MS", "artist": ["Playboi Carti", "Travis Scott"], "release_date": "2024", "genres": ["english", "plugg", "cloud rap", "hip hop", "experimental hip hop", "pop rap"], "wikipedia_summary": ["Jordan Terrell Carter (born September 13, 1995 or 1996), known professionally as Playboi Carti, is an American rapper. He first signed with local underground record label Awful Records in 2014, and later signed with ASAP Mob's record label AWGE, in a joint venture with Interscope Records two years later. Carter gained mainstream attention following the release of his eponymous debut mixtape (2017), which peaked at number 12 on the U.S. Billboard 200 and spawned the Billboard Hot 100-charting singles \"Magnolia\" and \"Wokeuplikethis\" (featuring Lil Uzi Vert).\nCarter's debut studio album Die Lit (2018) saw further commercial success, peaking at number three on the Billboard 200. Following a two-year hiatus, his second studio album, Whole Lotta Red (2020) debuted atop the chart and was met with positive reviews; it was listed as among the best albums of that year by and , with ranking it on their list of the \"200 Greatest Hip-Hop Albums of All Time\". He guest performed on ¥$'s 2024 single, \"Carnival\", which became his first song to peak atop the Hot 100. Carter's third studio album, (2025), was given similarly positive reviews and became his second consecutive number-one album on the 200.", "Jacques Bermon Webster II (born April 30, 1991), known professionally as Travis Scott (formerly stylized as Travi$ Scott), is an American rapper, singer, songwriter, and record producer. Scott has had five number-one hits on the U.S. Billboard Hot 100 chart, along with a total of over one hundred charting songs. In addition to ten Grammy Award nominations, he has won a Latin Grammy Award, Billboard Music Award, MTV Video Music Award, and several BET Hip Hop Awards. Scott's musical style has been described as a \"blend between traditional hip-hop and lo-fi\" and often characterized as \"ambient,\" with a heavily appraised influence from rappers Kanye West and Kid Cudi. His stage name is derived from the latter's real name, Scott Mescudi, combined with the name of a favorite uncle."]}
{"id": "Lil-Jon/Who-U-Wit%3F", "title": "Who U Wit", "artist": ["Lil Jon & The East Side Boyz"], "release_date": "1997-10-21", "genres": ["party rap", "dirty south", "rap"], "wikipedia_summary": ["Jonathan H. Smith (born January 17, 1971), better known by his stage name Lil Jon, is an American rapper, DJ, and record producer. Regarded as a progenitor of the club-oriented hip-hop subgenre crunk, his production and voice presence were instrumental in the genre's commercial breakthrough in the early 2000s. He was also the frontman of the crunk group Lil Jon & the East Side Boyz, with whom he has released five albums.\nHaving been credited on most crunk releases throughout the 2000s, Lil Jon produced several of the genre's Billboard Hot 100 hits including \"Salt Shaker\" by Ying Yang Twins, \"Cyclone\" by Baby Bash, \"Damn!\" by YoungBloodZ, \"Freek-a-Leek\" by Petey Pablo, \"Goodies\" by Ciara, and \"Yeah!\" by Usher. The latter won Lil Jon a Grammy Award for Best Rap/Sung Performance as part of his five Grammy Award nominations. As a lead artist, three of his own singles — \"Lovers and Friends\" (with the East Side Boyz featuring Usher and Ludacris), \"Get Low\" (with the East Side Boyz featuring Ying Yang Twins), and \"Snap Yo Fingers\" (featuring E-40 and Sean P) — have peaked within the chart's top ten. His debut studio album, (2010), was met with lukewarm critical and commercial response.", "N/A"]}
{"id": "Barry-White/I%27m-Gonna-Love-You-Just-a-Little-More-Baby", "title": "I'm Gonna Love You Just a Little More, Baby", "artist": ["Barry White"], "release_date": "2007-10-30", "genres": ["70s", "easy listening", "disco", "2008 universal fire victim"], "wikipedia_summary": ["Barry Eugene White (né Carter; September 12, 1944 – July 4, 2003) was an American singer and songwriter. A two-time Grammy Award winner known for his bass voice and romantic image, his greatest success came in the 1970s as a solo singer and with the Love Unlimited Orchestra, crafting many enduring R&B, soul, funk, and disco songs such as his two biggest hits: \"Can't Get Enough of Your Love, Babe\" and \"You're the First, the Last, My Everything\".\nWhite recorded 20 studio albums during the course of his career, but multiple versions and compilations were released worldwide that were certified gold, 41 of which also attained platinum status. White had 20 gold and 10 platinum singles, with worldwide record sales in excess of 100 million records, and is one of the best-selling music artists of all time. His influences included James Cleveland, Ray Charles, Aretha Franklin, the Supremes, the Four Tops, and Marvin Gaye."]}
